{
    "1": {
        "event": [
            "Full-time Match ends, Arsenal 0, Newcastle United 0.",
            "Second Half ends, Arsenal 0, Newcastle United 0.",
            "Attempt missed. Bukayo Saka (Arsenal) left footed shot from outside the box is high and wide to the left following a corner.",
            "Corner,  Arsenal. Conceded by Nick Pope.",
            "Yellow Card! Jamaal Lascelles (Newcastle United) is shown the yellow card.",
            "Yellow Card! Oleksandr Zinchenko (Arsenal) is shown the yellow card.",
            "Corner,  Newcastle United. Conceded by Bukayo Saka.",
            "Granit Xhaka (Arsenal) wins a free kick in the attacking half.",
            "Foul by Kieran Trippier (Newcastle United).",
            "Attempt saved. Eddie Nketiah (Arsenal) header from the centre of the box is saved in the centre of the goal. Assisted by Granit Xhaka.",
            "Thomas Partey (Arsenal) wins a free kick in the attacking half.",
            "Foul by Joelinton (Newcastle United).",
            "Attempt saved. Eddie Nketiah (Arsenal) left footed shot from the left side of the box is saved in the centre of the goal.",
            "Delay over. They are ready to continue.",
            "Substitution Substitution, Newcastle United. Allan Saint-Maximin replaces Joe Willock because of an injury.",
            "Delay in match  because of an injury Joe Willock (Newcastle United).",
            "Attempt missed. Gabriel Magalhães (Arsenal) left footed shot from outside the box is close, but misses to the right.",
            "Attempt blocked. Thomas Partey (Arsenal) right footed shot from outside the box is blocked. Assisted by Bukayo Saka.",
            "Corner,  Newcastle United. Conceded by Gabriel Martinelli.",
            "Attempt missed. Gabriel Martinelli (Arsenal) header from the right side of the six yard box is close, but misses to the left. Assisted by Martin Ødegaard with a cross following a corner.",
            "Corner,  Arsenal. Conceded by Joe Willock.",
            "Corner,  Arsenal. Conceded by Fabian Schär.",
            "Foul by Bruno Guimarães (Newcastle United).",
            "Granit Xhaka (Arsenal) wins a free kick in the attacking half.",
            "Substitution Substitution, Arsenal. Takehiro Tomiyasu replaces Ben White.",
            "Foul by Bruno Guimarães (Newcastle United).",
            "Gabriel Magalhães (Arsenal) wins a free kick in the defensive half.",
            "Corner,  Newcastle United. Conceded by Oleksandr Zinchenko.",
            "Corner,  Arsenal. Conceded by Kieran Trippier.",
            "Attempt blocked. Gabriel Martinelli (Arsenal) left footed shot from the left side of the box is blocked. Assisted by Bukayo Saka.",
            "Foul by Joe Willock (Newcastle United).",
            "Eddie Nketiah (Arsenal) wins a free kick in the defensive half.",
            "Offside, Newcastle United. Kieran Trippier tries a through ball, but Chris Wood is caught offside.",
            "Substitution Substitution, Newcastle United. Jacob Murphy replaces Miguel Almirón.",
            "Substitution Substitution, Newcastle United. Chris Wood replaces Callum Wilson.",
            "Foul by Oleksandr Zinchenko (Arsenal).",
            "Miguel Almirón (Newcastle United) wins a free kick in the defensive half.",
            "Corner,  Arsenal. Conceded by Joelinton.",
            "Attempt saved. Gabriel Martinelli (Arsenal) right footed shot from outside the box is saved in the bottom right corner. Assisted by Ben White.",
            "Delay over. They are ready to continue.",
            "Delay in match  because of an injury Bukayo Saka (Arsenal).",
            "Attempt missed. Oleksandr Zinchenko (Arsenal) right footed shot from the left side of the box misses to the right. Assisted by Granit Xhaka following a set piece situation.",
            "Yellow Card! Miguel Almirón (Newcastle United) is shown the yellow card.",
            "Yellow Card! Joelinton (Newcastle United) is shown the yellow card for a bad foul.",
            "Foul by Joelinton (Newcastle United).",
            "Bukayo Saka (Arsenal) wins a free kick on the right wing.",
            "Foul by Joe Willock (Newcastle United).",
            "William Saliba (Arsenal) wins a free kick in the defensive half.",
            "Attempt missed. Martin Ødegaard (Arsenal) left footed shot from outside the box is too high. Assisted by Granit Xhaka.",
            "Offside, Newcastle United. Callum Wilson tries a through ball, but Miguel Almirón is caught offside.",
            "Delay over. They are ready to continue.",
            "Delay in match  because of an injury Joelinton (Newcastle United).",
            "Delay over. They are ready to continue.",
            "Delay in match   (Newcastle United).",
            "Foul by Joe Willock (Newcastle United).",
            "Ben White (Arsenal) wins a free kick in the defensive half.",
            "Attempt missed. Callum Wilson (Newcastle United) right footed shot from the centre of the box is high and wide to the left. Assisted by Miguel Almirón.",
            "Attempt missed. Fabian Schär (Newcastle United) header from the left side of the box is just a bit too high. Assisted by Kieran Trippier with a cross following a set piece situation.",
            "Callum Wilson (Newcastle United) wins a free kick in the attacking half.",
            "Foul by Granit Xhaka (Arsenal).",
            "Kick Off! Second Half begins Arsenal 0, Newcastle United 0.",
            "Half-time First Half ends, Arsenal 0, Newcastle United 0.",
            "Attempt missed. Joelinton (Newcastle United) header from the right side of the six yard box is close, but misses the top right corner. Assisted by Fabian Schär following a corner.",
            "Attempt missed. Fabian Schär (Newcastle United) header from the left side of the six yard box misses to the right. Assisted by Kieran Trippier with a cross following a corner.",
            "Corner,  Newcastle United. Conceded by William Saliba.",
            "Attempt blocked. Sean Longstaff (Newcastle United) right footed shot from outside the box is blocked. Assisted by Joelinton.",
            "Foul by Thomas Partey (Arsenal).",
            "Callum Wilson (Newcastle United) wins a free kick in the defensive half.",
            "Offside, Newcastle United. Sean Longstaff tries a through ball, but Callum Wilson is caught offside.",
            "Attempt blocked. Bruno Guimarães (Newcastle United) right footed shot from outside the box is blocked.",
            "Yellow Card! Granit Xhaka (Arsenal) is shown the yellow card for a bad foul.",
            "Fabian Schär (Newcastle United) wins a free kick in the attacking half.",
            "Foul by Granit Xhaka (Arsenal).",
            "Delay over. They are ready to continue.",
            "VAR Decision: No Penalty Newcastle United.",
            "Foul by Dan Burn (Newcastle United).",
            "Gabriel Magalhães (Arsenal) wins a free kick in the defensive half.",
            "Yellow Card! Martin Ødegaard (Arsenal) is shown the yellow card for a bad foul.",
            "Bruno Guimarães (Newcastle United) wins a free kick in the defensive half.",
            "Foul by Martin Ødegaard (Arsenal).",
            "Attempt blocked. Thomas Partey (Arsenal) right footed shot from outside the box is blocked. Assisted by Bukayo Saka.",
            "Foul by Miguel Almirón (Newcastle United).",
            "Granit Xhaka (Arsenal) wins a free kick in the defensive half.",
            "Attempt missed. Gabriel Magalhães (Arsenal) header from the centre of the box is close, but misses to the right. Assisted by Martin Ødegaard with a cross following a set piece situation.",
            "Foul by Joelinton (Newcastle United).",
            "Martin Ødegaard (Arsenal) wins a free kick in the attacking half.",
            "Yellow Card! Eddie Nketiah (Arsenal) is shown the yellow card for a bad foul.",
            "Fabian Schär (Newcastle United) wins a free kick in the defensive half.",
            "Foul by Eddie Nketiah (Arsenal).",
            "Foul by Dan Burn (Newcastle United).",
            "Eddie Nketiah (Arsenal) wins a free kick in the defensive half.",
            "Yellow Card! Callum Wilson (Newcastle United) is shown the yellow card for a bad foul.",
            "Foul by Callum Wilson (Newcastle United).",
            "William Saliba (Arsenal) wins a free kick in the defensive half.",
            "Yellow Card! Bruno Guimarães (Newcastle United) is shown the yellow card for a bad foul.",
            "Eddie Nketiah (Arsenal) wins a free kick in the defensive half.",
            "Foul by Bruno Guimarães (Newcastle United).",
            "Callum Wilson (Newcastle United) wins a free kick on the left wing.",
            "Foul by William Saliba (Arsenal).",
            "Foul by Fabian Schär (Newcastle United).",
            "Eddie Nketiah (Arsenal) wins a free kick in the attacking half.",
            "Foul by Callum Wilson (Newcastle United).",
            "William Saliba (Arsenal) wins a free kick in the defensive half.",
            "Delay over. They are ready to continue.",
            "Delay in match  because of an injury Joelinton (Newcastle United).",
            "Attempt missed. Fabian Schär (Newcastle United) header from the centre of the box misses to the left. Assisted by Kieran Trippier with a cross following a corner.",
            "Corner,  Newcastle United. Conceded by Ben White.",
            "Offside, Arsenal. Aaron Ramsdale tries a through ball, but Bukayo Saka is caught offside.",
            "Attempt saved. Callum Wilson (Newcastle United) right footed shot from outside the box is saved in the bottom left corner. Assisted by Fabian Schär.",
            "Joe Willock (Newcastle United) wins a free kick in the attacking half.",
            "Foul by Thomas Partey (Arsenal).",
            "Foul by Granit Xhaka (Arsenal).",
            "Bruno Guimarães (Newcastle United) wins a free kick in the defensive half.",
            "Attempt missed. Granit Xhaka (Arsenal) left footed shot from the left side of the six yard box is close, but misses to the left. Assisted by Gabriel Martinelli with a through ball.",
            "Attempt blocked. Granit Xhaka (Arsenal) right footed shot from the centre of the box is blocked. Assisted by Gabriel Martinelli.",
            "Attempt saved. Bukayo Saka (Arsenal) left footed shot from a difficult angle on the right is saved in the centre of the goal. Assisted by Martin Ødegaard.",
            "Attempt missed. Martin Ødegaard (Arsenal) left footed shot from the centre of the box is too high. Assisted by Gabriel Martinelli.",
            "Attempt blocked. Gabriel Martinelli (Arsenal) right footed shot from the left side of the box is blocked. Assisted by Thomas Partey.",
            "Offside, Newcastle United. Kieran Trippier tries a through ball, but Fabian Schär is caught offside.",
            "Foul by Granit Xhaka (Arsenal).",
            "Sean Longstaff (Newcastle United) wins a free kick in the attacking half.",
            "Kick Off! First Half begins.",
            "Lineups are announced and players are warming up."
        ],
        "matchweek": "Matchweek 19",
        "team1_name": "Arsenal",
        "team1_startings": [
            "Aaron Ramsdale",
            "Ben White",
            "Gabriel Magalhães",
            "William Saliba",
            "Oleksandr Zinchenko",
            "Thomas Partey",
            "Martin Ødegaard",
            "Granit Xhaka",
            "Bukayo Saka",
            "Gabriel Martinelli",
            "Eddie Nketiah"
        ],
        "team1_subs": [
            "Matt Turner",
            "Kieran Tierney",
            "Rob Holding",
            "Takehiro Tomiyasu",
            "Fábio Vieira",
            "Albert Sambi Lokonga",
            "Mohamed Elneny",
            "Marquinhos",
            "Nathan Butler-Oyedeji"
        ],
        "team1_stat": {
            "possession_%": "66.8",
            "shots_on_target": "4",
            "shots": "17",
            "touches": "703",
            "passes": "536",
            "tackels": "13",
            "clearances": "17",
            "corners": "5",
            "offsides": "1",
            "yellow_cards": "4",
            "foul_conceded": "10"
        },
        "team2_name": "Newcastle United",
        "team2_startings": [
            "Nick Pope",
            "Kieran Trippier",
            "Sven Botman",
            "Fabian Schär",
            "Dan Burn",
            "Joe Willock",
            "Sean Longstaff",
            "Bruno Guimarães",
            "Joelinton",
            "Callum Wilson",
            "Miguel Almirón"
        ],
        "team2_subs": [
            "Martin Dúbravka",
            "Jamaal Lascelles",
            "Jamal Lewis",
            "Javier Manquillo",
            "Matt Ritchie",
            "Jacob Murphy",
            "Elliot Anderson",
            "Allan Saint-Maximin",
            "Chris Wood"
        ],
        "team2_stat": {
            "possession_%": "33.2",
            "shots_on_target": "1",
            "shots": "8",
            "touches": "446",
            "passes": "253",
            "tackels": "23",
            "clearances": "29",
            "corners": "5",
            "offsides": "4",
            "yellow_cards": "5",
            "foul_conceded": "16"
        }
    },
    "2": {
        "event": [
            "Full-time Match ends, Everton 1, Brighton and Hove Albion 4.",
            "Second Half ends, Everton 1, Brighton and Hove Albion 4.",
            "Foul by Julio Enciso (Brighton and Hove Albion).",
            "Séamus Coleman (Everton) wins a free kick on the right wing.",
            "Goal!  Everton 1, Brighton and Hove Albion 4. Demarai Gray (Everton) converts the penalty with a right footed shot to the bottom left corner.",
            "Penalty conceded by Robert Sánchez (Brighton and Hove Albion) after a foul in the penalty area.",
            "Penalty Everton. Alex Iwobi draws a foul in the penalty area.",
            "Yellow Card! Abdoulaye Doucouré (Everton) is shown the yellow card for a bad foul.",
            "Alexis Mac Allister (Brighton and Hove Albion) wins a free kick in the attacking half.",
            "Foul by Abdoulaye Doucouré (Everton).",
            "Attempt saved. Julio Enciso (Brighton and Hove Albion) left footed shot from the left side of the box is saved in the top left corner. Assisted by Pervis Estupiñán.",
            "Attempt saved. Julio Enciso (Brighton and Hove Albion) left footed shot from outside the box is saved in the centre of the goal. Assisted by Moisés Caicedo.",
            "Pervis Estupiñán (Brighton and Hove Albion) wins a free kick in the defensive half.",
            "Foul by Demarai Gray (Everton).",
            "Substitution Substitution, Everton. Ellis Simms replaces Dominic Calvert-Lewin.",
            "Attempt missed. Tariq Lamptey (Brighton and Hove Albion) right footed shot from the right side of the box is close, but misses to the right. Assisted by Pascal Groß.",
            "Attempt missed. Dominic Calvert-Lewin (Everton) right footed shot from outside the box misses to the left. Assisted by Alex Iwobi.",
            "Substitution Substitution, Brighton and Hove Albion. Andrew Moran replaces Solly March.",
            "Substitution Substitution, Brighton and Hove Albion. Adam Lallana replaces Kaoru Mitoma.",
            "Attempt blocked. Solly March (Brighton and Hove Albion) left footed shot from the centre of the box is blocked. Assisted by Julio Enciso.",
            "Attempt blocked. Alexis Mac Allister (Brighton and Hove Albion) right footed shot from outside the box is blocked. Assisted by Pascal Groß.",
            "Yellow Card! Alex Iwobi (Everton) is shown the yellow card for a bad foul.",
            "Foul by Alex Iwobi (Everton).",
            "Pervis Estupiñán (Brighton and Hove Albion) wins a free kick in the attacking half.",
            "Yellow Card! Isaac Price (Everton) is shown the yellow card for a bad foul.",
            "Attempt saved. Julio Enciso (Brighton and Hove Albion) right footed shot from outside the box is saved in the bottom left corner. Assisted by Pascal Groß.",
            "Substitution Substitution, Brighton and Hove Albion. Julio Enciso replaces Evan Ferguson.",
            "Substitution Substitution, Brighton and Hove Albion. Tariq Lamptey replaces Joël Veltman.",
            "Attempt missed. Demarai Gray (Everton) right footed shot from the centre of the box is too high. Assisted by Isaac Price with a cross.",
            "Attempt missed. Alexis Mac Allister (Brighton and Hove Albion) right footed shot from outside the box is high and wide to the right. Assisted by Kaoru Mitoma.",
            "Attempt saved. Solly March (Brighton and Hove Albion) right footed shot from the right side of the box is saved in the bottom right corner. Assisted by Pascal Groß.",
            "Attempt missed. Abdoulaye Doucouré (Everton) left footed shot from the left side of the box misses to the right. Assisted by Vitaliy Mykolenko.",
            "Substitution Substitution, Everton. Neal Maupay replaces Idrissa Gueye.",
            "Substitution Substitution, Everton. Séamus Coleman replaces Nathan Patterson because of an injury.",
            "Delay over. They are ready to continue.",
            "Substitution Substitution, Brighton and Hove Albion. Alexis Mac Allister replaces Jeremy Sarmiento.",
            "Delay in match  because of an injury Nathan Patterson (Everton).",
            "Corner,  Brighton and Hove Albion. Conceded by Nathan Patterson.",
            "Offside, Everton. Conor Coady tries a through ball, but Alex Iwobi is caught offside.",
            "Substitution Substitution, Everton. Isaac Price replaces Tom Davies.",
            "Substitution Substitution, Everton. Abdoulaye Doucouré replaces Dwight McNeil.",
            "Goal! Goal!  Everton 0, Brighton and Hove Albion 4. Pascal Groß (Brighton and Hove Albion) left footed shot from the centre of the box to the centre of the goal.",
            "Demarai Gray (Everton) wins a free kick on the left wing.",
            "Foul by Moisés Caicedo (Brighton and Hove Albion).",
            "Goal! Goal!  Everton 0, Brighton and Hove Albion 3. Solly March (Brighton and Hove Albion) left footed shot from the centre of the box to the bottom left corner. Assisted by Evan Ferguson.",
            "Goal! Goal!  Everton 0, Brighton and Hove Albion 2. Evan Ferguson (Brighton and Hove Albion) right footed shot from the centre of the box to the top left corner.",
            "Attempt missed. Evan Ferguson (Brighton and Hove Albion) right footed shot from outside the box is too high. Assisted by Pascal Groß.",
            "Kick Off! Second Half begins Everton 0, Brighton and Hove Albion 1.",
            "Half-time First Half ends, Everton 0, Brighton and Hove Albion 1.",
            "Attempt saved. Demarai Gray (Everton) right footed shot from outside the box is saved in the bottom left corner. Assisted by Vitaliy Mykolenko.",
            "Foul by Jeremy Sarmiento (Brighton and Hove Albion).",
            "Idrissa Gueye (Everton) wins a free kick in the attacking half.",
            "Yellow Card! Evan Ferguson (Brighton and Hove Albion) is shown the yellow card for a bad foul.",
            "Foul by Evan Ferguson (Brighton and Hove Albion).",
            "Idrissa Gueye (Everton) wins a free kick in the attacking half.",
            "Foul by Vitaliy Mykolenko (Everton).",
            "Solly March (Brighton and Hove Albion) wins a free kick in the defensive half.",
            "Corner,  Everton. Conceded by Solly March.",
            "Attempt blocked. Dwight McNeil (Everton) left footed shot from the right side of the box is blocked.",
            "Corner,  Everton. Conceded by Lewis Dunk.",
            "Vitaliy Mykolenko (Everton) wins a free kick in the defensive half.",
            "Foul by Solly March (Brighton and Hove Albion).",
            "Attempt missed. Dominic Calvert-Lewin (Everton) header from the centre of the box misses to the left. Assisted by Nathan Patterson with a cross.",
            "Demarai Gray (Everton) wins a free kick on the left wing.",
            "Foul by Joël Veltman (Brighton and Hove Albion).",
            "Attempt missed. James Tarkowski (Everton) header from the centre of the box misses to the right. Assisted by Demarai Gray with a cross following a corner.",
            "Corner,  Everton. Conceded by Joël Veltman.",
            "Attempt blocked. Pervis Estupiñán (Brighton and Hove Albion) left footed shot from outside the box is blocked.",
            "Attempt blocked. Solly March (Brighton and Hove Albion) left footed shot from outside the box is blocked. Assisted by Pascal Groß.",
            "Foul by Idrissa Gueye (Everton).",
            "Jeremy Sarmiento (Brighton and Hove Albion) wins a free kick in the attacking half.",
            "Corner,  Brighton and Hove Albion. Conceded by Conor Coady.",
            "Attempt missed. Evan Ferguson (Brighton and Hove Albion) right footed shot from outside the box is just a bit too high. Assisted by Moisés Caicedo.",
            "James Tarkowski (Everton) wins a free kick in the defensive half.",
            "Foul by Evan Ferguson (Brighton and Hove Albion).",
            "Evan Ferguson (Brighton and Hove Albion) wins a free kick in the defensive half.",
            "Foul by James Tarkowski (Everton).",
            "Evan Ferguson (Brighton and Hove Albion) hits the left post with a left footed shot from the centre of the box.",
            "Corner,  Everton. Conceded by Joël Veltman.",
            "Goal! Goal!  Everton 0, Brighton and Hove Albion 1. Kaoru Mitoma (Brighton and Hove Albion) right footed shot from the centre of the box to the centre of the goal. Assisted by Moisés Caicedo.",
            "Pervis Estupiñán (Brighton and Hove Albion) wins a free kick in the attacking half.",
            "Foul by Dwight McNeil (Everton).",
            "Jeremy Sarmiento (Brighton and Hove Albion) wins a free kick in the defensive half.",
            "Foul by James Tarkowski (Everton).",
            "Attempt missed. Kaoru Mitoma (Brighton and Hove Albion) header from the left side of the six yard box is high and wide to the right. Assisted by Solly March with a cross.",
            "Attempt blocked. Moisés Caicedo (Brighton and Hove Albion) right footed shot from outside the box is blocked.",
            "Attempt saved. Tom Davies (Everton) right footed shot from outside the box is saved in the centre of the goal. Assisted by Dominic Calvert-Lewin.",
            "Corner,  Everton. Conceded by Robert Sánchez.",
            "Attempt saved. Alex Iwobi (Everton) right footed shot from the left side of the box is saved in the centre of the goal. Assisted by Dominic Calvert-Lewin.",
            "Foul by Jeremy Sarmiento (Brighton and Hove Albion).",
            "Idrissa Gueye (Everton) wins a free kick in the attacking half.",
            "Tom Davies (Everton) wins a free kick in the defensive half.",
            "Foul by Solly March (Brighton and Hove Albion).",
            "Kick Off! First Half begins.",
            "Lineups are announced and players are warming up."
        ],
        "matchweek": "Matchweek 19",
        "team1_name": "Everton",
        "team1_startings": [
            "Jordan Pickford",
            "James Tarkowski",
            "Nathan Patterson",
            "Vitaliy Mykolenko",
            "Conor Coady",
            "Alex Iwobi",
            "Tom Davies",
            "Idrissa Gueye",
            "Dwight McNeil",
            "Dominic Calvert-Lewin",
            "Demarai Gray"
        ],
        "team1_subs": [
            "Asmir Begovic",
            "Yerry Mina",
            "Ben Godfrey",
            "Séamus Coleman",
            "Rúben Vinagre",
            "Abdoulaye Doucouré",
            "Isaac Price",
            "Neal Maupay",
            "Ellis Simms"
        ],
        "team1_stat": {
            "possession_%": "48.9",
            "shots_on_target": "4",
            "shots": "10",
            "touches": "663",
            "passes": "478",
            "tackels": "16",
            "clearances": "15",
            "corners": "5",
            "offsides": "1",
            "yellow_cards": "3",
            "foul_conceded": "8"
        },
        "team2_name": "Brighton and Hove Albion",
        "team2_startings": [
            "Robert Sánchez",
            "Lewis Dunk",
            "Levi Colwill",
            "Pervis Estupiñán",
            "Joël Veltman",
            "Solly March",
            "Pascal Groß",
            "Jeremy Sarmiento",
            "Kaoru Mitoma",
            "Moisés Caicedo",
            "Evan Ferguson"
        ],
        "team2_subs": [
            "Jason Steele",
            "Tariq Lamptey",
            "Jan Paul van Hecke",
            "Alexis Mac Allister",
            "Adam Lallana",
            "Billy Gilmour",
            "Andrew Moran",
            "Leandro Trossard",
            "Julio Enciso"
        ],
        "team2_stat": {
            "possession_%": "51.1",
            "shots_on_target": "8",
            "shots": "19",
            "touches": "676",
            "passes": "512",
            "tackels": "16",
            "clearances": "13",
            "corners": "2",
            "offsides": "0",
            "yellow_cards": "1",
            "foul_conceded": "10"
        }
    },
    "3": {
        "event": [
            "Full-time Match ends, Leicester City 0, Fulham 1.",
            "Second Half ends, Leicester City 0, Fulham 1.",
            "Yellow Card! Bernd Leno (Fulham) is shown the yellow card.",
            "Attempt missed. Ayoze Pérez (Leicester City) left footed shot from the centre of the box is high and wide to the left. Assisted by Jamie Vardy.",
            "Youri Tielemans (Leicester City) wins a free kick in the defensive half.",
            "Foul by Harry Wilson (Fulham).",
            "Kenny Tete (Fulham) wins a free kick in the defensive half.",
            "Foul by Harvey Barnes (Leicester City).",
            "Foul by Aleksandar Mitrovic (Fulham).",
            "Wout Faes (Leicester City) wins a free kick in the defensive half.",
            "Attempt missed. Harry Wilson (Fulham) left footed shot from the centre of the box is close, but misses to the right. Assisted by Tom Cairney with a through ball following a fast break.",
            "Delay over. They are ready to continue.",
            "Delay in match  because of an injury Harry Wilson (Fulham).",
            "Delay over. They are ready to continue.",
            "Delay in match  because of an injury Antonee Robinson (Fulham).",
            "Attempt missed. Youri Tielemans (Leicester City) left footed shot from outside the box is close, but misses to the right. Assisted by Daniel Amartey.",
            "Substitution Substitution, Fulham. Issa Diop replaces Willian.",
            "Attempt saved. Ayoze Pérez (Leicester City) right footed shot from the left side of the box is saved in the bottom left corner. Assisted by Marc Albrighton.",
            "Youri Tielemans (Leicester City) hits the bar with a right footed shot from outside the box following a corner.",
            "Attempt blocked. Youri Tielemans (Leicester City) right footed shot from outside the box is blocked.",
            "Corner,  Leicester City. Conceded by Aleksandar Mitrovic.",
            "Yellow Card! Aleksandar Mitrovic (Fulham) is shown the yellow card for a bad foul.",
            "Harvey Barnes (Leicester City) wins a free kick in the attacking half.",
            "Foul by Aleksandar Mitrovic (Fulham).",
            "Corner,  Leicester City. Conceded by Bernd Leno.",
            "Attempt saved. Ayoze Pérez (Leicester City) right footed shot from outside the box is saved in the bottom left corner. Assisted by Kelechi Iheanacho.",
            "Offside, Fulham. Kenny Tete tries a through ball, but Aleksandar Mitrovic is caught offside.",
            "Yellow Card! Timothy Castagne (Leicester City) is shown the yellow card for a bad foul.",
            "Foul by Timothy Castagne (Leicester City).",
            "Tom Cairney (Fulham) wins a free kick in the defensive half.",
            "Substitution Substitution, Leicester City. Kelechi Iheanacho replaces Luke Thomas.",
            "Substitution Substitution, Leicester City. Nampalys Mendy replaces Wilfred Ndidi.",
            "Corner,  Leicester City. Conceded by Kenny Tete.",
            "Yellow Card! Kenny Tete (Fulham) is shown the yellow card for a bad foul.",
            "Foul by Kenny Tete (Fulham).",
            "Ayoze Pérez (Leicester City) wins a free kick in the defensive half.",
            "Substitution Substitution, Fulham. Harry Wilson replaces Bobby De Cordova-Reid.",
            "Delay over. They are ready to continue.",
            "Delay in match  because of an injury Kenny Tete (Fulham).",
            "Yellow Card! Tom Cairney (Fulham) is shown the yellow card for a bad foul.",
            "Ayoze Pérez (Leicester City) wins a free kick in the defensive half.",
            "Foul by Tom Cairney (Fulham).",
            "Yellow Card! Wilfred Ndidi (Leicester City) is shown the yellow card for a bad foul.",
            "Foul by Wilfred Ndidi (Leicester City).",
            "Aleksandar Mitrovic (Fulham) wins a free kick in the defensive half.",
            "Yellow Card! João Palhinha (Fulham) is shown the yellow card for a bad foul.",
            "Foul by João Palhinha (Fulham).",
            "Youri Tielemans (Leicester City) wins a free kick on the right wing.",
            "Substitution Substitution, Fulham. Tom Cairney replaces Andreas Pereira.",
            "Attempt missed. Youri Tielemans (Leicester City) left footed shot from outside the box is close, but misses to the left.",
            "Corner,  Leicester City. Conceded by Bernd Leno.",
            "Attempt saved. Jamie Vardy (Leicester City) right footed shot from the centre of the box is saved in the bottom right corner. Assisted by Ayoze Pérez.",
            "Kenny Tete (Fulham) wins a free kick in the defensive half.",
            "Foul by Harvey Barnes (Leicester City).",
            "Yellow Card! Tosin Adarabioyo (Fulham) is shown the yellow card.",
            "Foul by Harvey Barnes (Leicester City).",
            "Harrison Reed (Fulham) wins a free kick on the right wing.",
            "Attempt saved. Harvey Barnes (Leicester City) right footed shot from the centre of the box is saved in the top centre of the goal. Assisted by Luke Thomas with a through ball.",
            "Ayoze Pérez (Leicester City) wins a free kick in the defensive half.",
            "Foul by Kenny Tete (Fulham).",
            "Attempt blocked. Aleksandar Mitrovic (Fulham) right footed shot from outside the box is blocked. Assisted by Andreas Pereira.",
            "Foul by Harvey Barnes (Leicester City).",
            "Kenny Tete (Fulham) wins a free kick in the defensive half.",
            "Kick Off! Second Half begins Leicester City 0, Fulham 1.",
            "Half-time First Half ends, Leicester City 0, Fulham 1.",
            "Foul by Jamie Vardy (Leicester City).",
            "Tim Ream (Fulham) wins a free kick in the defensive half.",
            "Attempt saved. Tosin Adarabioyo (Fulham) right footed shot from outside the box is saved in the top centre of the goal.",
            "Foul by Ayoze Pérez (Leicester City).",
            "Harrison Reed (Fulham) wins a free kick on the right wing.",
            "Wilfred Ndidi (Leicester City) wins a free kick in the defensive half.",
            "Foul by Bobby De Cordova-Reid (Fulham).",
            "Attempt missed. Harrison Reed (Fulham) right footed shot from outside the box is high and wide to the right following a corner.",
            "Corner,  Fulham. Conceded by Luke Thomas.",
            "Foul by Marc Albrighton (Leicester City).",
            "Andreas Pereira (Fulham) wins a free kick in the attacking half.",
            "Attempt missed. Timothy Castagne (Leicester City) header from the centre of the box is close, but misses to the left. Assisted by Marc Albrighton with a cross.",
            "Foul by Tosin Adarabioyo (Fulham).",
            "Ayoze Pérez (Leicester City) wins a free kick on the left wing.",
            "Ayoze Pérez (Leicester City) wins a free kick in the defensive half.",
            "Foul by Bobby De Cordova-Reid (Fulham).",
            "Foul by Wout Faes (Leicester City).",
            "Aleksandar Mitrovic (Fulham) wins a free kick in the attacking half.",
            "Foul by Harvey Barnes (Leicester City).",
            "Kenny Tete (Fulham) wins a free kick in the defensive half.",
            "Attempt blocked. Youri Tielemans (Leicester City) right footed shot from outside the box is blocked.",
            "Corner,  Leicester City. Conceded by Bernd Leno.",
            "Attempt saved. Jamie Vardy (Leicester City) header from the right side of the six yard box is saved in the bottom right corner.",
            "Attempt blocked. Harvey Barnes (Leicester City) right footed shot from the left side of the box is blocked. Assisted by Ayoze Pérez.",
            "Delay over. They are ready to continue.",
            "Delay in match  because of an injury Harrison Reed (Fulham).",
            "Attempt missed. Ayoze Pérez (Leicester City) right footed shot from the centre of the box is too high. Assisted by Youri Tielemans with a cross.",
            "Corner,  Leicester City. Conceded by Tim Ream.",
            "Attempt missed. João Palhinha (Fulham) right footed shot from outside the box misses to the left.",
            "Attempt missed. Aleksandar Mitrovic (Fulham) right footed shot from the centre of the box misses to the right. Assisted by Bobby De Cordova-Reid.",
            "Goal! Goal!  Leicester City 0, Fulham 1. Aleksandar Mitrovic (Fulham) left footed shot from the centre of the box to the bottom left corner. Assisted by Willian with a through ball.",
            "Corner,  Fulham. Conceded by Daniel Amartey.",
            "Attempt blocked. Aleksandar Mitrovic (Fulham) header from the centre of the box is blocked. Assisted by Harrison Reed with a cross.",
            "Delay over. They are ready to continue.",
            "Delay in match  because of an injury Aleksandar Mitrovic (Fulham).",
            "Aleksandar Mitrovic (Fulham) wins a free kick in the defensive half.",
            "Foul by Wilfred Ndidi (Leicester City).",
            "Attempt saved. Wilfred Ndidi (Leicester City) right footed shot from outside the box is saved in the top left corner. Assisted by Marc Albrighton.",
            "Substitution Substitution, Leicester City. Marc Albrighton replaces Boubakary Soumaré because of an injury.",
            "Delay over. They are ready to continue.",
            "Delay in match  because of an injury Boubakary Soumaré (Leicester City).",
            "Attempt missed. Willian (Fulham) right footed shot from the left side of the box is close, but misses to the right. Assisted by Kenny Tete.",
            "Youri Tielemans (Leicester City) wins a free kick in the defensive half.",
            "Foul by João Palhinha (Fulham).",
            "Attempt missed. Willian (Fulham) right footed shot from the centre of the box is high and wide to the right.",
            "Attempt missed. Andreas Pereira (Fulham) right footed shot from the centre of the box is close, but misses to the right. Assisted by Antonee Robinson.",
            "Corner,  Fulham. Conceded by Timothy Castagne.",
            "Kick Off! First Half begins.",
            "Lineups are announced and players are warming up."
        ],
        "matchweek": "Matchweek 19",
        "team1_name": "Leicester City",
        "team1_startings": [
            "Danny Ward",
            "Wout Faes",
            "Daniel Amartey",
            "Timothy Castagne",
            "Luke Thomas",
            "Harvey Barnes",
            "Youri Tielemans",
            "Ayoze Pérez",
            "Wilfred Ndidi",
            "Boubakary Soumaré",
            "Jamie Vardy"
        ],
        "team1_subs": [
            "Daniel Iversen",
            "Çaglar Söyüncü",
            "Jannik Vestergaard",
            "Marc Albrighton",
            "Nampalys Mendy",
            "Lewis Brunt",
            "Kasey McAteer",
            "Kelechi Iheanacho"
        ],
        "team1_stat": {
            "possession_%": "61.2",
            "shots_on_target": "6",
            "shots": "15",
            "touches": "732",
            "passes": "551",
            "tackels": "17",
            "clearances": "15",
            "corners": "6",
            "offsides": "0",
            "yellow_cards": "2",
            "foul_conceded": "12"
        },
        "team2_name": "Fulham",
        "team2_startings": [
            "Bernd Leno",
            "Kenny Tete",
            "Tosin Adarabioyo",
            "Tim Ream",
            "Antonee Robinson",
            "Harrison Reed",
            "Bobby De Cordova-Reid",
            "Andreas Pereira",
            "Willian",
            "João Palhinha",
            "Aleksandar Mitrovic"
        ],
        "team2_subs": [
            "Marek Rodák",
            "Layvin Kurzawa",
            "Issa Diop",
            "Harry Wilson",
            "Tom Cairney",
            "Nathaniel Chalobah",
            "Dan James",
            "Manor Solomon",
            "Carlos Vinícius"
        ],
        "team2_stat": {
            "possession_%": "38.8",
            "shots_on_target": "2",
            "shots": "11",
            "touches": "566",
            "passes": "348",
            "tackels": "13",
            "clearances": "32",
            "corners": "3",
            "offsides": "1",
            "yellow_cards": "6",
            "foul_conceded": "11"
        }
    },
    "4": {
        "event": [
            "Full-time Match ends, Manchester United 3, Bournemouth 0.",
            "Second Half ends, Manchester United 3, Bournemouth 0.",
            "Corner,  Bournemouth. Conceded by David de Gea.",
            "Attempt saved. Jaidon Anthony (Bournemouth) left footed shot from the left side of the box is saved in the top centre of the goal.",
            "Corner,  Manchester United. Conceded by Chris Mepham.",
            "Corner,  Manchester United. Conceded by Jack Stacey.",
            "Substitution Substitution, Manchester United. Lisandro Martínez replaces Victor Lindelöf.",
            "Goal! Goal!  Manchester United 3, Bournemouth 0. Marcus Rashford (Manchester United) left footed shot from the left side of the six yard box to the bottom left corner. Assisted by Bruno Fernandes.",
            "Corner,  Manchester United. Conceded by Mark Travers.",
            "Attempt saved. Bruno Fernandes (Manchester United) right footed shot from the right side of the box is saved in the bottom right corner. Assisted by Marcus Rashford.",
            "Substitution Substitution, Bournemouth. Joe Rothwell replaces Jefferson Lerma.",
            "Attempt missed. Jaidon Anthony (Bournemouth) left footed shot from the left side of the box is close, but misses to the right. Assisted by Dominic Solanke.",
            "Attempt blocked. Diogo Dalot (Manchester United) left footed shot from outside the box is blocked.",
            "Corner,  Manchester United. Conceded by Chris Mepham.",
            "Attempt saved. Alejandro Garnacho (Manchester United) left footed shot from the left side of the box is saved in the bottom left corner. Assisted by Bruno Fernandes.",
            "Corner,  Manchester United. Conceded by Mark Travers.",
            "Attempt saved. Diogo Dalot (Manchester United) right footed shot from the right side of the box is saved in the top centre of the goal. Assisted by Fred.",
            "Foul by Anthony Elanga (Manchester United).",
            "Jaidon Anthony (Bournemouth) wins a free kick in the defensive half.",
            "Attempt blocked. Anthony Elanga (Manchester United) right footed shot from the right side of the box is blocked. Assisted by Bruno Fernandes.",
            "Alejandro Garnacho (Manchester United) hits the right post with a right footed shot from the left side of the box. Assisted by Fred.",
            "Attempt missed. Bruno Fernandes (Manchester United) right footed shot from outside the box is too high. Assisted by Diogo Dalot.",
            "Substitution Substitution, Bournemouth. Kieffer Moore replaces Philip Billing.",
            "Substitution Substitution, Bournemouth. Siriki Dembélé replaces Ryan Christie.",
            "Yellow Card! Jack Stacey (Bournemouth) is shown the yellow card for a bad foul.",
            "Foul by Jack Stacey (Bournemouth).",
            "Alejandro Garnacho (Manchester United) wins a free kick on the left wing.",
            "Attempt blocked. Alejandro Garnacho (Manchester United) right footed shot from outside the box is blocked. Assisted by Luke Shaw.",
            "Attempt missed. Marcus Rashford (Manchester United) right footed shot from outside the box misses to the left. Assisted by Bruno Fernandes.",
            "Dominic Solanke (Bournemouth) wins a free kick on the left wing.",
            "Foul by Casemiro (Manchester United).",
            "Substitution Substitution, Manchester United. Anthony Elanga replaces Anthony Martial.",
            "Substitution Substitution, Manchester United. Diogo Dalot replaces Aaron Wan-Bissaka.",
            "Substitution Substitution, Manchester United. Fred replaces Christian Eriksen.",
            "Ryan Christie (Bournemouth) wins a free kick in the attacking half.",
            "Foul by Luke Shaw (Manchester United).",
            "Harry Maguire (Manchester United) wins a free kick in the defensive half.",
            "Foul by Lloyd Kelly (Bournemouth).",
            "Corner,  Bournemouth. Conceded by Aaron Wan-Bissaka.",
            "Substitution Substitution, Bournemouth. Jack Stacey replaces Adam Smith.",
            "Philip Billing (Bournemouth) wins a free kick in the defensive half.",
            "Foul by Christian Eriksen (Manchester United).",
            "Attempt saved. Jaidon Anthony (Bournemouth) left footed shot from the left side of the box is saved in the top centre of the goal. Assisted by Philip Billing.",
            "Attempt saved. Dominic Solanke (Bournemouth) header from the centre of the box is saved in the bottom left corner. Assisted by Lewis Cook with a cross.",
            "Attempt saved. Philip Billing (Bournemouth) header from the centre of the box is saved in the centre of the goal. Assisted by Adam Smith with a cross.",
            "Delay over. They are ready to continue.",
            "Delay in match  because of an injury Anthony Martial (Manchester United).",
            "Attempt missed. Anthony Martial (Manchester United) header from very close range misses to the left. Assisted by Casemiro with a cross.",
            "Ryan Christie (Bournemouth) wins a free kick in the defensive half.",
            "Foul by Luke Shaw (Manchester United).",
            "Goal! Goal!  Manchester United 2, Bournemouth 0. Luke Shaw (Manchester United) right footed shot from the centre of the box to the bottom left corner. Assisted by Alejandro Garnacho.",
            "Attempt blocked. Marcus Rashford (Manchester United) right footed shot from outside the box is blocked.",
            "Yellow Card! Adam Smith (Bournemouth) is shown the yellow card for a bad foul.",
            "Foul by Adam Smith (Bournemouth).",
            "Alejandro Garnacho (Manchester United) wins a free kick in the attacking half.",
            "Kick Off! Second Half begins Manchester United 1, Bournemouth 0.",
            "Half-time First Half ends, Manchester United 1, Bournemouth 0.",
            "Substitution Substitution, Manchester United. Alejandro Garnacho replaces Donny van de Beek because of an injury.",
            "Delay over. They are ready to continue.",
            "Delay in match  because of an injury Donny van de Beek (Manchester United).",
            "Foul by Marcos Senesi (Bournemouth).",
            "Donny van de Beek (Manchester United) wins a free kick in the defensive half.",
            "Corner,  Bournemouth. Conceded by Victor Lindelöf.",
            "Corner,  Manchester United. Conceded by Marcos Senesi.",
            "Attempt blocked. Christian Eriksen (Manchester United) right footed shot from outside the box is blocked.",
            "Yellow Card! Philip Billing (Bournemouth) is shown the yellow card for a bad foul.",
            "Casemiro (Manchester United) wins a free kick in the attacking half.",
            "Foul by Philip Billing (Bournemouth).",
            "Attempt blocked. Bruno Fernandes (Manchester United) right footed shot from outside the box is blocked. Assisted by Donny van de Beek.",
            "Attempt missed. Casemiro (Manchester United) right footed shot from outside the box misses to the right. Assisted by Aaron Wan-Bissaka.",
            "Corner,  Bournemouth. Conceded by Harry Maguire.",
            "Philip Billing (Bournemouth) wins a free kick in the defensive half.",
            "Foul by Casemiro (Manchester United).",
            "Offside, Bournemouth. Lewis Cook tries a through ball, but Jaidon Anthony is caught offside.",
            "Attempt missed. Dominic Solanke (Bournemouth) header from the centre of the box is high and wide to the left. Assisted by Lewis Cook with a cross following a corner.",
            "Corner,  Bournemouth. Conceded by Donny van de Beek.",
            "Attempt blocked. Philip Billing (Bournemouth) left footed shot from outside the box is blocked.",
            "Ryan Christie (Bournemouth) wins a free kick in the attacking half.",
            "Foul by Casemiro (Manchester United).",
            "Goal! Goal!  Manchester United 1, Bournemouth 0. Casemiro (Manchester United) right footed shot from the centre of the box to the top left corner. Assisted by Christian Eriksen with a cross   following a set piece situation.",
            "Foul by Adam Smith (Bournemouth).",
            "Marcus Rashford (Manchester United) wins a free kick on the left wing.",
            "Offside, Bournemouth. Marcos Senesi tries a through ball, but Jaidon Anthony is caught offside.",
            "Foul by Casemiro (Manchester United).",
            "Philip Billing (Bournemouth) wins a free kick on the left wing.",
            "Adam Smith (Bournemouth) wins a free kick in the defensive half.",
            "Foul by Donny van de Beek (Manchester United).",
            "Attempt missed. Anthony Martial (Manchester United) header from the centre of the box is close, but misses to the left. Assisted by Luke Shaw with a cross.",
            "Foul by Anthony Martial (Manchester United).",
            "Ryan Christie (Bournemouth) wins a free kick in the defensive half.",
            "Foul by Luke Shaw (Manchester United).",
            "Ryan Christie (Bournemouth) wins a free kick in the defensive half.",
            "Jefferson Lerma (Bournemouth) wins a free kick in the defensive half.",
            "Foul by Donny van de Beek (Manchester United).",
            "Foul by Anthony Martial (Manchester United).",
            "Lewis Cook (Bournemouth) wins a free kick in the defensive half.",
            "Foul by Lewis Cook (Bournemouth).",
            "Luke Shaw (Manchester United) wins a free kick in the defensive half.",
            "Kick Off! First Half begins.",
            "Lineups are announced and players are warming up."
        ],
        "matchweek": "Matchweek 19",
        "team1_name": "Manchester United",
        "team1_startings": [
            "David de Gea",
            "Victor Lindelöf",
            "Harry Maguire",
            "Luke Shaw",
            "Aaron Wan-Bissaka",
            "Bruno Fernandes",
            "Marcus Rashford",
            "Christian Eriksen",
            "Casemiro",
            "Donny van de Beek",
            "Anthony Martial"
        ],
        "team1_subs": [
            "Tom Heaton",
            "Lisandro Martínez",
            "Tyrell Malacia",
            "Raphaël Varane",
            "Diogo Dalot",
            "Fred",
            "Scott McTominay",
            "Anthony Elanga",
            "Alejandro Garnacho"
        ],
        "team1_stat": {
            "possession_%": "58.5",
            "shots_on_target": "6",
            "shots": "18",
            "touches": "731",
            "passes": "579",
            "tackels": "9",
            "clearances": "11",
            "corners": "6",
            "offsides": "0",
            "yellow_cards": "0",
            "foul_conceded": "13"
        },
        "team2_name": "Bournemouth",
        "team2_startings": [
            "Mark Travers",
            "Lloyd Kelly",
            "Chris Mepham",
            "Adam Smith",
            "Marcos Senesi",
            "Lewis Cook",
            "Jefferson Lerma",
            "Ryan Christie",
            "Jaidon Anthony",
            "Dominic Solanke",
            "Philip Billing"
        ],
        "team2_subs": [
            "Cameron Plain",
            "Jack Stephens",
            "Jack Stacey",
            "Jordan Zemura",
            "Joe Rothwell",
            "Siriki Dembélé",
            "Ben Pearson",
            "Jamal Lowe",
            "Kieffer Moore"
        ],
        "team2_stat": {
            "possession_%": "41.5",
            "shots_on_target": "4",
            "shots": "7",
            "touches": "579",
            "passes": "406",
            "tackels": "18",
            "clearances": "19",
            "corners": "5",
            "offsides": "2",
            "yellow_cards": "3",
            "foul_conceded": "7"
        }
    },
    "5": {
        "event": [
            "Full-time Match ends, Brentford 3, Liverpool 1.",
            "Second Half ends, Brentford 3, Liverpool 1.",
            "Offside, Brentford. Zanka tries a through ball, but Keane Lewis-Potter is caught offside.",
            "Substitution Substitution, Brentford. Mads Bech Sørensen replaces Rico Henry.",
            "Foul by Zanka (Brentford).",
            "Curtis Jones (Liverpool) wins a free kick in the defensive half.",
            "Saman Ghoddos (Brentford) wins a free kick in the attacking half.",
            "Foul by Fabinho (Liverpool).",
            "Foul by Sergi Canós (Brentford).",
            "Joël Matip (Liverpool) wins a free kick in the defensive half.",
            "Attempt blocked. Naby Keïta (Liverpool) right footed shot from the centre of the box is blocked.",
            "Substitution Substitution, Brentford. Sergi Canós replaces Bryan Mbeumo.",
            "Substitution Substitution, Brentford. Saman Ghoddos replaces Vitaly Janelt because of an injury.",
            "Goal! Goal!  Brentford 3, Liverpool 1. Bryan Mbeumo (Brentford) left footed shot from the centre of the box to the centre of the goal    following a fast break.",
            "Substitution Substitution, Liverpool. Curtis Jones replaces Alex Oxlade-Chamberlain.",
            "Foul by Fabinho (Liverpool).",
            "Rico Henry (Brentford) wins a free kick in the defensive half.",
            "Attempt missed. Ibrahima Konaté (Liverpool) header from the centre of the box is close, but misses to the left. Assisted by Trent Alexander-Arnold with a cross following a corner.",
            "Corner,  Liverpool. Conceded by Rico Henry.",
            "Corner,  Liverpool. Conceded by Ben Mee.",
            "Attempt blocked. Mohamed Salah (Liverpool) left footed shot from the right side of the box is blocked. Assisted by Naby Keïta.",
            "Offside, Liverpool. Fabinho tries a through ball, but Darwin Núñez is caught offside.",
            "Josh Dasilva (Brentford) wins a free kick in the defensive half.",
            "Foul by Thiago (Liverpool).",
            "Substitution Substitution, Brentford. Keane Lewis-Potter replaces Yoane Wissa.",
            "Substitution Substitution, Brentford. Josh Dasilva replaces Mathias Jensen.",
            "Yellow Card! Darwin Núñez (Liverpool) is shown the yellow card.",
            "Foul by Darwin Núñez (Liverpool).",
            "Mads Roerslev (Brentford) wins a free kick in the defensive half.",
            "Corner,  Liverpool. Conceded by Mads Roerslev.",
            "Attempt missed. Darwin Núñez (Liverpool) right footed shot from the right side of the box misses to the left. Assisted by Mohamed Salah.",
            "Corner,  Liverpool. Conceded by Vitaly Janelt.",
            "Hand ball by Vitaly Janelt (Brentford).",
            "Foul by Naby Keïta (Liverpool).",
            "Christian Nørgaard (Brentford) wins a free kick in the defensive half.",
            "Corner,  Liverpool. Conceded by Christian Nørgaard.",
            "Attempt blocked. Thiago (Liverpool) right footed shot from outside the box is blocked.",
            "Attempt blocked. Thiago (Liverpool) right footed shot from outside the box is blocked.",
            "Offside, Brentford. Vitaly Janelt tries a through ball, but Zanka is caught offside.",
            "Yellow Card! Thiago (Liverpool) is shown the yellow card for a bad foul.",
            "Yoane Wissa (Brentford) wins a free kick in the defensive half.",
            "Foul by Thiago (Liverpool).",
            "Attempt saved. Fabinho (Liverpool) right footed shot from outside the box is saved in the bottom left corner. Assisted by Thiago.",
            "Corner,  Brentford. Conceded by Darwin Núñez.",
            "Goal! Goal!  Brentford 2, Liverpool 1. Alex Oxlade-Chamberlain (Liverpool) header from the centre of the box to the bottom left corner. Assisted by Trent Alexander-Arnold with a cross.",
            "VAR Decision: No Goal  Brentford 2-0 Liverpool.",
            "GOAL OVERTURNED BY VAR: Darwin Núñez (Liverpool) scores but the goal is ruled out after a VAR review.",
            "Offside, Liverpool. Thiago tries a through ball, but Darwin Núñez is caught offside.",
            "Offside, Liverpool. Alex Oxlade-Chamberlain tries a through ball, but Ibrahima Konaté is caught offside.",
            "Corner,  Liverpool. Conceded by Ethan Pinnock.",
            "Substitution Substitution, Liverpool. Naby Keïta replaces Harvey Elliott.",
            "Substitution Substitution, Liverpool. Joël Matip replaces Virgil van Dijk.",
            "Kick Off! Second Half begins Brentford 2, Liverpool 0.",
            "Substitution Substitution, Liverpool. Andrew Robertson replaces Konstantinos Tsimikas.",
            "Half-time First Half ends, Brentford 2, Liverpool 0.",
            "Foul by Mathias Jensen (Brentford).",
            "Thiago (Liverpool) wins a free kick in the defensive half.",
            "Attempt saved. Konstantinos Tsimikas (Liverpool) header from the centre of the box is saved in the bottom left corner. Assisted by Harvey Elliott with a cross.",
            "Goal! Goal!  Brentford 2, Liverpool 0. Yoane Wissa (Brentford) header from the centre of the box to the bottom left corner. Assisted by Mathias Jensen with a cross.",
            "VAR Decision: No Goal  Brentford 1-0 Liverpool.",
            "Offside, Brentford. Yoane Wissa tries a through ball, but Ben Mee is caught offside.",
            "Attempt missed. Yoane Wissa (Brentford) right footed shot from the centre of the box misses to the right. Assisted by Bryan Mbeumo with a cross following a corner.",
            "GOAL OVERTURNED BY VAR: Yoane Wissa (Brentford) scores but the goal is ruled out after a VAR review.",
            "Corner,  Brentford. Conceded by Konstantinos Tsimikas.",
            "Offside, Brentford. Vitaly Janelt tries a through ball, but Yoane Wissa is caught offside.",
            "Attempt saved. Alex Oxlade-Chamberlain (Liverpool) right footed shot from outside the box is saved in the centre of the goal. Assisted by Harvey Elliott with a headed pass.",
            "Attempt blocked. Ibrahima Konaté (Liverpool) header from the centre of the box is blocked. Assisted by Konstantinos Tsimikas with a cross.",
            "Corner,  Liverpool. Conceded by Ethan Pinnock.",
            "Offside, Brentford. Ben Mee tries a through ball, but Yoane Wissa is caught offside.",
            "Attempt saved. Ethan Pinnock (Brentford) header from very close range is saved in the centre of the goal.",
            "Offside, Brentford. Ethan Pinnock tries a through ball, but Yoane Wissa is caught offside.",
            "Attempt saved. Ethan Pinnock (Brentford) left footed shot from very close range is saved in the centre of the goal.",
            "Attempt saved. Christian Nørgaard (Brentford) header from a difficult angle on the right is saved in the centre of the goal. Assisted by Bryan Mbeumo with a cross.",
            "Corner,  Brentford. Conceded by Fabinho.",
            "Attempt blocked. Mathias Jensen (Brentford) right footed shot from the right side of the box is blocked.",
            "Attempt blocked. Konstantinos Tsimikas (Liverpool) left footed shot from the left side of the box is blocked. Assisted by Alex Oxlade-Chamberlain.",
            "Corner,  Liverpool. Conceded by Vitaly Janelt.",
            "Attempt saved. Konstantinos Tsimikas (Liverpool) left footed shot from the centre of the box is saved in the bottom left corner. Assisted by Alex Oxlade-Chamberlain.",
            "Attempt missed. Alex Oxlade-Chamberlain (Liverpool) right footed shot from the centre of the box misses to the right.",
            "VAR Decision: Goal Liverpool -  Brentford 1-0 Liverpool (Ibrahima Konaté).",
            "Own Goal! Own Goal by Ibrahima Konaté, Liverpool.  Brentford 1, Liverpool 0.Goal confirmed following VAR Review.",
            "Corner,  Brentford. Conceded by Alisson.",
            "Attempt saved. Bryan Mbeumo (Brentford) left footed shot from the centre of the box is saved in the bottom right corner. Assisted by Yoane Wissa with a through ball.",
            "Attempt missed. Bryan Mbeumo (Brentford) header from the right side of the six yard box misses to the right. Assisted by Rico Henry with a cross.",
            "Offside, Brentford. Christian Nørgaard tries a through ball, but Yoane Wissa is caught offside.",
            "Attempt saved. Vitaly Janelt (Brentford) left footed shot from outside the box is saved in the bottom right corner.",
            "Foul by Alex Oxlade-Chamberlain (Liverpool).",
            "Christian Nørgaard (Brentford) wins a free kick in the defensive half.",
            "Yellow Card! Harvey Elliott (Liverpool) is shown the yellow card for a bad foul.",
            "Foul by Harvey Elliott (Liverpool).",
            "Rico Henry (Brentford) wins a free kick in the defensive half.",
            "Attempt blocked. Darwin Núñez (Liverpool) left footed shot from the left side of the six yard box is blocked. Assisted by Mohamed Salah with a through ball.",
            "Offside, Liverpool. Harvey Elliott tries a through ball, but Virgil van Dijk is caught offside.",
            "Corner,  Liverpool. Conceded by Ethan Pinnock.",
            "Attempt blocked. Darwin Núñez (Liverpool) with an attempt from the centre of the box is blocked. Assisted by Konstantinos Tsimikas.",
            "Yellow Card! Zanka (Brentford) is shown the yellow card for a bad foul.",
            "Foul by Zanka (Brentford).",
            "Darwin Núñez (Liverpool) wins a free kick in the attacking half.",
            "Kick Off! First Half begins.",
            "Lineups are announced and players are warming up."
        ],
        "matchweek": "Matchweek 19",
        "team1_name": "Brentford",
        "team1_startings": [
            "David Raya",
            "Ethan Pinnock",
            "Zanka",
            "Ben Mee",
            "Rico Henry",
            "Christian Nørgaard",
            "Mathias Jensen",
            "Vitaly Janelt",
            "Mads Roerslev",
            "Yoane Wissa",
            "Bryan Mbeumo"
        ],
        "team1_subs": [
            "Thomas Strakosha",
            "Mads Bech Sørensen",
            "Tristan Crama",
            "Josh Dasilva",
            "Mikkel Damsgaard",
            "Ryan Trevitt",
            "Sergi Canós",
            "Saman Ghoddos",
            "Keane Lewis-Potter"
        ],
        "team1_stat": {
            "possession_%": "27",
            "shots_on_target": "7",
            "shots": "10",
            "touches": "432",
            "passes": "237",
            "tackels": "17",
            "clearances": "37",
            "corners": "4",
            "offsides": "7",
            "yellow_cards": "1",
            "foul_conceded": "5"
        },
        "team2_name": "Liverpool",
        "team2_startings": [
            "Alisson",
            "Virgil van Dijk",
            "Ibrahima Konaté",
            "Konstantinos Tsimikas",
            "Trent Alexander-Arnold",
            "Fabinho",
            "Thiago",
            "Harvey Elliott",
            "Mohamed Salah",
            "Alex Oxlade-Chamberlain",
            "Darwin Núñez"
        ],
        "team2_subs": [
            "Caoimhín Kelleher",
            "Joe Gomez",
            "Andrew Robertson",
            "Joël Matip",
            "Stefan Bajcetic",
            "Nathaniel Phillips",
            "Naby Keïta",
            "Curtis Jones",
            "Fábio Carvalho"
        ],
        "team2_stat": {
            "possession_%": "73",
            "shots_on_target": "6",
            "shots": "16",
            "touches": "857",
            "passes": "652",
            "tackels": "9",
            "clearances": "15",
            "corners": "9",
            "offsides": "4",
            "yellow_cards": "3",
            "foul_conceded": "8"
        }
    },
    "6": {
        "event": [
            "Full-time Match ends, Brighton and Hove Albion 2, Arsenal 4.",
            "Second Half ends, Brighton and Hove Albion 2, Arsenal 4.",
            "Attempt saved. Evan Ferguson (Brighton and Hove Albion) right footed shot from outside the box is saved in the bottom right corner. Assisted by Tariq Lamptey.",
            "Attempt missed. Lewis Dunk (Brighton and Hove Albion) header from the centre of the box is too high. Assisted by Pascal Groß with a cross following a corner.",
            "Corner,  Brighton and Hove Albion. Conceded by Rob Holding.",
            "VAR Decision: No Goal  Brighton and Hove Albion 2-4 Arsenal.",
            "GOAL OVERTURNED BY VAR: Kaoru Mitoma (Brighton and Hove Albion) scores but the goal is ruled out after a VAR review.",
            "Offside, Brighton and Hove Albion. Evan Ferguson tries a through ball, but Kaoru Mitoma is caught offside.",
            "Kaoru Mitoma (Brighton and Hove Albion) wins a free kick on the left wing.",
            "Foul by Bukayo Saka (Arsenal).",
            "Substitution Substitution, Arsenal. Rob Holding replaces Martin Ødegaard.",
            "Corner,  Brighton and Hove Albion. Conceded by Granit Xhaka.",
            "Mohamed Elneny (Arsenal) wins a free kick in the attacking half.",
            "Foul by Pascal Groß (Brighton and Hove Albion).",
            "Yellow Card! Jeremy Sarmiento (Brighton and Hove Albion) is shown the yellow card.",
            "Jeremy Sarmiento (Brighton and Hove Albion) has gone down, but the referee deems it simulation.",
            "Offside, Brighton and Hove Albion. Pervis Estupiñán tries a through ball, but Kaoru Mitoma is caught offside.",
            "Levi Colwill (Brighton and Hove Albion) wins a free kick in the defensive half.",
            "Foul by Eddie Nketiah (Arsenal).",
            "Goal! Goal!  Brighton and Hove Albion 2, Arsenal 4. Evan Ferguson (Brighton and Hove Albion) right footed shot from the centre of the box to the centre of the goal.",
            "Substitution Substitution, Brighton and Hove Albion. Julio Enciso replaces Solly March.",
            "Attempt missed. Jeremy Sarmiento (Brighton and Hove Albion) right footed shot from the right side of the six yard box misses to the right. Assisted by Solly March with a cross.",
            "Foul by Kieran Tierney (Arsenal).",
            "Solly March (Brighton and Hove Albion) wins a free kick on the right wing.",
            "Foul by Solly March (Brighton and Hove Albion).",
            "Gabriel Magalhães (Arsenal) wins a free kick in the defensive half.",
            "Substitution Substitution, Arsenal. Mohamed Elneny replaces Thomas Partey.",
            "Goal! Goal!  Brighton and Hove Albion 1, Arsenal 4. Gabriel Martinelli (Arsenal) right footed shot from the centre of the box to the bottom left corner. Assisted by Martin Ødegaard with a through ball   following a fast break.",
            "Goal! Goal!  Brighton and Hove Albion 1, Arsenal 3. Kaoru Mitoma (Brighton and Hove Albion) right footed shot from the centre of the box to the bottom right corner. Assisted by Pascal Groß with a through ball.",
            "Foul by Gabriel Martinelli (Arsenal).",
            "Tariq Lamptey (Brighton and Hove Albion) wins a free kick in the defensive half.",
            "Substitution Substitution, Brighton and Hove Albion. Jeremy Sarmiento replaces Adam Lallana.",
            "Substitution Substitution, Brighton and Hove Albion. Evan Ferguson replaces Leandro Trossard.",
            "Substitution Substitution, Arsenal. Kieran Tierney replaces Oleksandr Zinchenko.",
            "Substitution Substitution, Arsenal. Takehiro Tomiyasu replaces Ben White.",
            "Corner,  Brighton and Hove Albion. Conceded by Eddie Nketiah.",
            "Corner,  Brighton and Hove Albion. Conceded by William Saliba.",
            "Attempt missed. William Saliba (Arsenal) right footed shot from the centre of the box is close, but misses to the right following a set piece situation.",
            "Attempt saved. Gabriel Magalhães (Arsenal) left footed shot from the centre of the box is saved in the centre of the goal. Assisted by Martin Ødegaard with a cross.",
            "Yellow Card! Solly March (Brighton and Hove Albion) is shown the yellow card for a bad foul.",
            "Oleksandr Zinchenko (Arsenal) wins a free kick on the left wing.",
            "Foul by Solly March (Brighton and Hove Albion).",
            "Foul by Pervis Estupiñán (Brighton and Hove Albion).",
            "Eddie Nketiah (Arsenal) wins a free kick on the right wing.",
            "Yellow Card! Bukayo Saka (Arsenal) is shown the yellow card for a bad foul.",
            "Pervis Estupiñán (Brighton and Hove Albion) wins a free kick on the left wing.",
            "Foul by Bukayo Saka (Arsenal).",
            "Attempt missed. Gabriel Magalhães (Arsenal) header from the centre of the box is high and wide to the left. Assisted by Thomas Partey.",
            "Offside, Brighton and Hove Albion. Adam Lallana tries a through ball, but Pascal Groß is caught offside.",
            "Attempt blocked. Pascal Groß (Brighton and Hove Albion) left footed shot from the centre of the box is blocked.",
            "Goal! Goal!  Brighton and Hove Albion 0, Arsenal 3. Eddie Nketiah (Arsenal) right footed shot from very close range to the centre of the goal.",
            "Attempt saved. Gabriel Martinelli (Arsenal) left footed shot from the left side of the box is saved in the centre of the goal. Assisted by Thomas Partey.",
            "Kick Off! Second Half begins Brighton and Hove Albion 0, Arsenal 2.",
            "Half-time First Half ends, Brighton and Hove Albion 0, Arsenal 2.",
            "Yellow Card! Thomas Partey (Arsenal) is shown the yellow card for a bad foul.",
            "Adam Lallana (Brighton and Hove Albion) wins a free kick in the defensive half.",
            "Foul by Thomas Partey (Arsenal).",
            "Yellow Card! Gabriel Magalhães (Arsenal) is shown the yellow card.",
            "Yellow Card! Billy Gilmour (Brighton and Hove Albion) is shown the yellow card for a bad foul.",
            "Foul by Billy Gilmour (Brighton and Hove Albion).",
            "Thomas Partey (Arsenal) wins a free kick in the defensive half.",
            "Goal! Goal!  Brighton and Hove Albion 0, Arsenal 2. Martin Ødegaard (Arsenal) left footed shot from the centre of the box to the bottom right corner    following a corner.",
            "Corner,  Arsenal. Conceded by Pervis Estupiñán.",
            "Offside, Brighton and Hove Albion. Levi Colwill tries a through ball, but Leandro Trossard is caught offside.",
            "Attempt blocked. Gabriel Martinelli (Arsenal) right footed shot from the centre of the box is blocked. Assisted by Bukayo Saka.",
            "Foul by Eddie Nketiah (Arsenal).",
            "Lewis Dunk (Brighton and Hove Albion) wins a free kick in the defensive half.",
            "Foul by Gabriel Martinelli (Arsenal).",
            "Tariq Lamptey (Brighton and Hove Albion) wins a free kick in the defensive half.",
            "Adam Lallana (Brighton and Hove Albion) wins a free kick in the defensive half.",
            "Foul by Gabriel Magalhães (Arsenal).",
            "Offside, Brighton and Hove Albion. Kaoru Mitoma tries a through ball, but Leandro Trossard is caught offside.",
            "Corner,  Brighton and Hove Albion. Conceded by Aaron Ramsdale.",
            "Attempt saved. Leandro Trossard (Brighton and Hove Albion) right footed shot from the right side of the box is saved in the top centre of the goal. Assisted by Pascal Groß.",
            "Corner,  Arsenal. Conceded by Pervis Estupiñán.",
            "Attempt blocked. Thomas Partey (Arsenal) left footed shot from the centre of the box is blocked.",
            "Corner,  Arsenal. Conceded by Lewis Dunk.",
            "Corner,  Brighton and Hove Albion. Conceded by Eddie Nketiah.",
            "Corner,  Brighton and Hove Albion. Conceded by Aaron Ramsdale.",
            "Attempt saved. Leandro Trossard (Brighton and Hove Albion) left footed shot from the centre of the box is saved in the bottom left corner. Assisted by Adam Lallana.",
            "Hand ball by Eddie Nketiah (Arsenal).",
            "Attempt blocked. Solly March (Brighton and Hove Albion) left footed shot from outside the box is blocked.",
            "Foul by Eddie Nketiah (Arsenal).",
            "Lewis Dunk (Brighton and Hove Albion) wins a free kick in the defensive half.",
            "Attempt missed. Eddie Nketiah (Arsenal) right footed shot from the centre of the box is close, but misses to the right. Assisted by Granit Xhaka.",
            "Attempt blocked. Gabriel Martinelli (Arsenal) right footed shot from the centre of the box is blocked. Assisted by Martin Ødegaard.",
            "Attempt saved. Oleksandr Zinchenko (Arsenal) left footed shot from the left side of the six yard box is saved in the bottom left corner.",
            "Corner,  Arsenal. Conceded by Robert Sánchez.",
            "Oleksandr Zinchenko (Arsenal) wins a free kick on the left wing.",
            "Foul by Solly March (Brighton and Hove Albion).",
            "Goal! Goal!  Brighton and Hove Albion 0, Arsenal 1. Bukayo Saka (Arsenal) left footed shot from the centre of the box to the centre of the goal.",
            "Attempt blocked. Gabriel Martinelli (Arsenal) right footed shot from the left side of the box is blocked. Assisted by Oleksandr Zinchenko.",
            "Kick Off! First Half begins.",
            "Lineups are announced and players are warming up."
        ],
        "matchweek": "Matchweek 18",
        "team1_name": "Brighton and Hove Albion",
        "team1_startings": [
            "Robert Sánchez",
            "Tariq Lamptey",
            "Lewis Dunk",
            "Levi Colwill",
            "Pervis Estupiñán",
            "Solly March",
            "Pascal Groß",
            "Adam Lallana",
            "Kaoru Mitoma",
            "Billy Gilmour",
            "Leandro Trossard"
        ],
        "team1_subs": [
            "Jason Steele",
            "Jan Paul van Hecke",
            "Joël Veltman",
            "Ed Turns",
            "Andrew Moran",
            "Jack Hinshelwood",
            "Jeremy Sarmiento",
            "Julio Enciso",
            "Evan Ferguson"
        ],
        "team1_stat": {
            "possession_%": "67.8",
            "shots_on_target": "5",
            "shots": "9",
            "touches": "765",
            "passes": "597",
            "tackels": "8",
            "clearances": "5",
            "corners": "7",
            "offsides": "5",
            "yellow_cards": "3",
            "foul_conceded": "7"
        },
        "team2_name": "Arsenal",
        "team2_startings": [
            "Aaron Ramsdale",
            "Ben White",
            "Gabriel Magalhães",
            "William Saliba",
            "Oleksandr Zinchenko",
            "Thomas Partey",
            "Martin Ødegaard",
            "Granit Xhaka",
            "Bukayo Saka",
            "Gabriel Martinelli",
            "Eddie Nketiah"
        ],
        "team2_subs": [
            "Matt Turner",
            "Kieran Tierney",
            "Rob Holding",
            "Cédric Soares",
            "Takehiro Tomiyasu",
            "Fábio Vieira",
            "Albert Sambi Lokonga",
            "Mohamed Elneny",
            "Marquinhos"
        ],
        "team2_stat": {
            "possession_%": "32.2",
            "shots_on_target": "7",
            "shots": "14",
            "touches": "441",
            "passes": "288",
            "tackels": "19",
            "clearances": "24",
            "corners": "4",
            "offsides": "0",
            "yellow_cards": "3",
            "foul_conceded": "11"
        }
    },
    "7": {
        "event": [
            "Full-time Match ends, Tottenham Hotspur 0, Aston Villa 2.",
            "Second Half ends, Tottenham Hotspur 0, Aston Villa 2.",
            "Boubacar Kamara (Aston Villa) wins a free kick in the defensive half.",
            "Foul by Oliver Skipp (Tottenham Hotspur).",
            "Attempt missed. Ollie Watkins (Aston Villa) header from very close range is too high following a corner.",
            "Corner,  Aston Villa. Conceded by Ryan Sessegnon.",
            "Foul by Jan Bednarek (Aston Villa).",
            "Harry Kane (Tottenham Hotspur) wins a free kick in the defensive half.",
            "Yellow Card! Calum Chambers (Aston Villa) is shown the yellow card.",
            "Foul by Calum Chambers (Aston Villa).",
            "Son Heung-Min (Tottenham Hotspur) wins a free kick in the defensive half.",
            "Son Heung-Min (Tottenham Hotspur) wins a free kick in the defensive half.",
            "Foul by Calum Chambers (Aston Villa).",
            "Foul by Emerson Royal (Tottenham Hotspur).",
            "Boubacar Kamara (Aston Villa) wins a free kick in the defensive half.",
            "Substitution Substitution, Tottenham Hotspur. Djed Spence replaces Ivan Perisic.",
            "Substitution Substitution, Tottenham Hotspur. Oliver Skipp replaces Pierre-Emile Højbjerg.",
            "Attempt missed. Calum Chambers (Aston Villa) right footed shot from outside the box is high and wide to the right. Assisted by Ollie Watkins.",
            "Corner,  Tottenham Hotspur. Conceded by Jan Bednarek.",
            "Attempt blocked. Son Heung-Min (Tottenham Hotspur) right footed shot from outside the box is blocked. Assisted by Pierre-Emile Højbjerg.",
            "Philippe Coutinho (Aston Villa) wins a free kick on the left wing.",
            "Foul by Emerson Royal (Tottenham Hotspur).",
            "Corner,  Aston Villa. Conceded by Pape Sarr.",
            "Substitution Substitution, Aston Villa. Danny Ings replaces Ezri Konsa.",
            "Substitution Substitution, Aston Villa. Calum Chambers replaces Emiliano Buendía.",
            "Substitution Substitution, Aston Villa. Jan Bednarek replaces Douglas Luiz because of an injury.",
            "Substitution Substitution, Tottenham Hotspur. Emerson Royal replaces Matt Doherty.",
            "Substitution Substitution, Tottenham Hotspur. Pape Sarr replaces Yves Bissouma.",
            "Attempt saved. Douglas Luiz (Aston Villa) left footed shot from outside the box is saved in the centre of the goal. Assisted by Emiliano Buendía.",
            "Substitution Substitution, Aston Villa. Philippe Coutinho replaces John McGinn because of an injury.",
            "Ezri Konsa (Aston Villa) wins a free kick in the defensive half.",
            "Foul by Cristian Romero (Tottenham Hotspur).",
            "Goal! Goal!  Tottenham Hotspur 0, Aston Villa 2. Douglas Luiz (Aston Villa) right footed shot from the centre of the box to the centre of the goal. Assisted by John McGinn with a through ball.",
            "Offside, Tottenham Hotspur. Ivan Perisic tries a through ball, but Son Heung-Min is caught offside.",
            "Attempt blocked. Douglas Luiz (Aston Villa) right footed shot from outside the box is blocked. Assisted by John McGinn.",
            "Attempt missed. Harry Kane (Tottenham Hotspur) left footed shot from the centre of the box is high and wide to the left. Assisted by Son Heung-Min with a headed pass.",
            "Yellow Card! Ezri Konsa (Aston Villa) is shown the yellow card.",
            "Substitution Substitution, Aston Villa. Matty Cash replaces Leon Bailey.",
            "John McGinn (Aston Villa) wins a free kick in the defensive half.",
            "Foul by Ryan Sessegnon (Tottenham Hotspur).",
            "Attempt blocked. Ollie Watkins (Aston Villa) left footed shot from a difficult angle on the left is blocked. Assisted by Lucas Digne with a cross.",
            "Attempt blocked. Ollie Watkins (Aston Villa) left footed shot from the centre of the box is blocked. Assisted by Emiliano Buendía.",
            "Substitution Substitution, Tottenham Hotspur. Ryan Sessegnon replaces Bryan Gil.",
            "Corner,  Tottenham Hotspur. Conceded by Lucas Digne.",
            "Corner,  Aston Villa. Conceded by Pierre-Emile Højbjerg.",
            "Attempt blocked. Douglas Luiz (Aston Villa) right footed shot from outside the box is blocked.",
            "Yellow Card! Yves Bissouma (Tottenham Hotspur) is shown the yellow card for a bad foul.",
            "Boubacar Kamara (Aston Villa) wins a free kick in the attacking half.",
            "Foul by Yves Bissouma (Tottenham Hotspur).",
            "Bryan Gil (Tottenham Hotspur) wins a free kick in the attacking half.",
            "Foul by Lucas Digne (Aston Villa).",
            "Attempt missed. Ivan Perisic (Tottenham Hotspur) left footed shot from the left side of the box is too high. Assisted by Yves Bissouma with a cross following a set piece situation.",
            "Yellow Card! Tyrone Mings (Aston Villa) is shown the yellow card for a bad foul.",
            "Foul by Tyrone Mings (Aston Villa).",
            "Harry Kane (Tottenham Hotspur) wins a free kick in the attacking half.",
            "Foul by Pierre-Emile Højbjerg (Tottenham Hotspur).",
            "John McGinn (Aston Villa) wins a free kick in the attacking half.",
            "Goal! Goal!  Tottenham Hotspur 0, Aston Villa 1. Emiliano Buendía (Aston Villa) right footed shot from the centre of the box to the bottom left corner. Assisted by Ollie Watkins.",
            "Attempt saved. Douglas Luiz (Aston Villa) right footed shot from outside the box is saved in the centre of the goal. Assisted by Boubacar Kamara.",
            "Foul by Harry Kane (Tottenham Hotspur).",
            "Tyrone Mings (Aston Villa) wins a free kick in the defensive half.",
            "Kick Off! Second Half begins Tottenham Hotspur 0, Aston Villa 0.",
            "Half-time First Half ends, Tottenham Hotspur 0, Aston Villa 0.",
            "Attempt missed. Emiliano Buendía (Aston Villa) right footed shot from outside the box is close, but misses to the right. Assisted by Ollie Watkins.",
            "Attempt saved. Son Heung-Min (Tottenham Hotspur) right footed shot from a difficult angle and long range on the left is saved in the top centre of the goal.",
            "Hand ball by Ashley Young (Aston Villa).",
            "Corner,  Tottenham Hotspur. Conceded by John McGinn.",
            "Attempt blocked. Harry Kane (Tottenham Hotspur) header from the centre of the box is blocked. Assisted by Ivan Perisic.",
            "Yellow Card! Ben Davies (Tottenham Hotspur) is shown the yellow card for a bad foul.",
            "Ashley Young (Aston Villa) wins a free kick in the defensive half.",
            "Foul by Ben Davies (Tottenham Hotspur).",
            "Harry Kane (Tottenham Hotspur) wins a free kick in the attacking half.",
            "Foul by Emiliano Buendía (Aston Villa).",
            "Yellow Card! Clément Lenglet (Tottenham Hotspur) is shown the yellow card.",
            "Leon Bailey (Aston Villa) wins a free kick in the defensive half.",
            "Foul by Clément Lenglet (Tottenham Hotspur).",
            "Corner,  Tottenham Hotspur. Conceded by John McGinn.",
            "Yellow Card! Cristian Romero (Tottenham Hotspur) is shown the yellow card for a bad foul.",
            "Foul by Cristian Romero (Tottenham Hotspur).",
            "Ollie Watkins (Aston Villa) wins a free kick in the defensive half.",
            "Foul by Tyrone Mings (Aston Villa).",
            "Harry Kane (Tottenham Hotspur) wins a free kick in the attacking half.",
            "Corner,  Tottenham Hotspur. Conceded by Boubacar Kamara.",
            "Attempt blocked. Matt Doherty (Tottenham Hotspur) right footed shot from a difficult angle on the right is blocked. Assisted by Bryan Gil.",
            "Foul by Leon Bailey (Aston Villa).",
            "Ivan Perisic (Tottenham Hotspur) wins a free kick in the defensive half.",
            "Foul by Pierre-Emile Højbjerg (Tottenham Hotspur).",
            "Boubacar Kamara (Aston Villa) wins a free kick in the defensive half.",
            "Attempt missed. Ollie Watkins (Aston Villa) right footed shot from the centre of the box misses to the left. Assisted by Lucas Digne.",
            "Douglas Luiz (Aston Villa) wins a free kick in the defensive half.",
            "Foul by Cristian Romero (Tottenham Hotspur).",
            "Foul by Ivan Perisic (Tottenham Hotspur).",
            "Ashley Young (Aston Villa) wins a free kick in the defensive half.",
            "Son Heung-Min (Tottenham Hotspur) wins a free kick in the defensive half.",
            "Foul by Leon Bailey (Aston Villa).",
            "Attempt blocked. Ashley Young (Aston Villa) right footed shot from outside the box is blocked. Assisted by Douglas Luiz.",
            "Douglas Luiz (Aston Villa) wins a free kick in the attacking half.",
            "Foul by Yves Bissouma (Tottenham Hotspur).",
            "Kick Off! First Half begins.",
            "Lineups are announced and players are warming up."
        ],
        "matchweek": "Matchweek 18",
        "team1_name": "Tottenham Hotspur",
        "team1_startings": [
            "Hugo Lloris",
            "Cristian Romero",
            "Ben Davies",
            "Clément Lenglet",
            "Matt Doherty",
            "Pierre-Emile Højbjerg",
            "Ivan Perisic",
            "Yves Bissouma",
            "Son Heung-Min",
            "Harry Kane",
            "Bryan Gil"
        ],
        "team1_subs": [
            "Fraser Forster",
            "Davinson Sánchez",
            "Emerson Royal",
            "Eric Dier",
            "Djed Spence",
            "Japhet Tanganga",
            "Oliver Skipp",
            "Ryan Sessegnon",
            "Pape Sarr"
        ],
        "team1_stat": {
            "possession_%": "59.3",
            "shots_on_target": "2",
            "shots": "6",
            "touches": "747",
            "passes": "579",
            "tackels": "14",
            "clearances": "9",
            "corners": "5",
            "offsides": "1",
            "yellow_cards": "4",
            "foul_conceded": "15"
        },
        "team2_name": "Aston Villa",
        "team2_startings": [
            "Robin Olsen",
            "Ezri Konsa",
            "Tyrone Mings",
            "Ashley Young",
            "Lucas Digne",
            "Douglas Luiz",
            "John McGinn",
            "Emiliano Buendía",
            "Boubacar Kamara",
            "Ollie Watkins",
            "Leon Bailey"
        ],
        "team2_subs": [
            "Emiliano Martínez",
            "Matty Cash",
            "Calum Chambers",
            "Ludwig Augustinsson",
            "Jan Bednarek",
            "Morgan Sanson",
            "Philippe Coutinho",
            "Danny Ings",
            "Cameron Archer"
        ],
        "team2_stat": {
            "possession_%": "40.7",
            "shots_on_target": "4",
            "shots": "13",
            "touches": "591",
            "passes": "403",
            "tackels": "18",
            "clearances": "21",
            "corners": "3",
            "offsides": "0",
            "yellow_cards": "3",
            "foul_conceded": "10"
        }
    },
    "8": {
        "event": [
            "Full-time Match ends, Nottingham Forest 1, Chelsea 1.",
            "Second Half ends, Nottingham Forest 1, Chelsea 1.",
            "Yellow Card! Renan Lodi (Nottingham Forest) is shown the yellow card for a bad foul.",
            "Hakim Ziyech (Chelsea) wins a free kick on the right wing.",
            "Foul by Renan Lodi (Nottingham Forest).",
            "Yellow Card! Conor Gallagher (Chelsea) is shown the yellow card for a bad foul.",
            "Sam Surridge (Nottingham Forest) wins a free kick in the defensive half.",
            "Foul by Conor Gallagher (Chelsea).",
            "Substitution Substitution, Nottingham Forest. Neco Williams replaces Taiwo Awoniyi.",
            "Foul by Conor Gallagher (Chelsea).",
            "Jack Colback (Nottingham Forest) wins a free kick in the defensive half.",
            "Substitution Substitution, Chelsea. Carney Chukwuemeka replaces Christian Pulisic.",
            "Hakim Ziyech (Chelsea) wins a free kick in the defensive half.",
            "Foul by Willy Boly (Nottingham Forest).",
            "Foul by Mateo Kovacic (Chelsea).",
            "Ryan Yates (Nottingham Forest) wins a free kick in the defensive half.",
            "Substitution Substitution, Nottingham Forest. Sam Surridge replaces Brennan Johnson.",
            "Attempt missed. Pierre-Emerick Aubameyang (Chelsea) header from the left side of the six yard box misses to the left. Assisted by Hakim Ziyech with a cross.",
            "Substitution Substitution, Nottingham Forest. Jack Colback replaces Orel Mangala.",
            "Hakim Ziyech (Chelsea) wins a free kick on the right wing.",
            "Foul by Renan Lodi (Nottingham Forest).",
            "Substitution Substitution, Chelsea. Pierre-Emerick Aubameyang replaces Mason Mount.",
            "Substitution Substitution, Chelsea. Conor Gallagher replaces Raheem Sterling.",
            "Substitution Substitution, Chelsea. Hakim Ziyech replaces Jorginho.",
            "Offside, Nottingham Forest. Ryan Yates tries a through ball, but Renan Lodi is caught offside.",
            "Attempt missed. Ryan Yates (Nottingham Forest) left footed shot from the centre of the box misses to the left. Assisted by Taiwo Awoniyi.",
            "Attempt missed. Taiwo Awoniyi (Nottingham Forest) left footed shot from the centre of the box misses to the right. Assisted by Renan Lodi.",
            "Offside, Chelsea. César Azpilicueta tries a through ball, but Raheem Sterling is caught offside.",
            "Foul by Orel Mangala (Nottingham Forest).",
            "César Azpilicueta (Chelsea) wins a free kick in the defensive half.",
            "Foul by Brennan Johnson (Nottingham Forest).",
            "Marc Cucurella (Chelsea) wins a free kick in the defensive half.",
            "Ryan Yates (Nottingham Forest) wins a free kick in the defensive half.",
            "Foul by Kai Havertz (Chelsea).",
            "Goal! Goal!  Nottingham Forest 1, Chelsea 1. Serge Aurier (Nottingham Forest) right footed shot from the left side of the six yard box to the centre of the goal. Assisted by Willy Boly with a headed pass   following a corner.",
            "Corner,  Nottingham Forest. Conceded by César Azpilicueta.",
            "Attempt blocked. Brennan Johnson (Nottingham Forest) left footed shot from outside the box is blocked.",
            "Substitution Substitution, Chelsea. Mateo Kovacic replaces Denis Zakaria.",
            "Offside, Nottingham Forest. Morgan Gibbs-White tries a through ball, but Willy Boly is caught offside.",
            "Ryan Yates (Nottingham Forest) wins a free kick in the attacking half.",
            "Foul by Mason Mount (Chelsea).",
            "Foul by Kalidou Koulibaly (Chelsea).",
            "Taiwo Awoniyi (Nottingham Forest) wins a free kick in the attacking half.",
            "Attempt missed. Serge Aurier (Nottingham Forest) right footed shot from the right side of the box is too high. Assisted by Morgan Gibbs-White following a set piece situation.",
            "Attempt blocked. Morgan Gibbs-White (Nottingham Forest) right footed shot from outside the box is blocked. Assisted by Taiwo Awoniyi.",
            "Foul by Kai Havertz (Chelsea).",
            "Orel Mangala (Nottingham Forest) wins a free kick in the attacking half.",
            "Morgan Gibbs-White (Nottingham Forest) hits the bar with a right footed shot from outside the box. Assisted by Ryan Yates.",
            "Yellow Card! César Azpilicueta (Chelsea) is shown the yellow card for a bad foul.",
            "Foul by César Azpilicueta (Chelsea).",
            "Renan Lodi (Nottingham Forest) wins a free kick on the left wing.",
            "Orel Mangala (Nottingham Forest) wins a free kick in the defensive half.",
            "Foul by César Azpilicueta (Chelsea).",
            "Christian Pulisic (Chelsea) wins a free kick on the left wing.",
            "Foul by Remo Freuler (Nottingham Forest).",
            "Attempt saved. Brennan Johnson (Nottingham Forest) right footed shot from the right side of the box is saved in the centre of the goal. Assisted by Morgan Gibbs-White.",
            "Foul by Serge Aurier (Nottingham Forest).",
            "Christian Pulisic (Chelsea) wins a free kick on the left wing.",
            "Attempt saved. Taiwo Awoniyi (Nottingham Forest) left footed shot from the left side of the box is saved in the bottom left corner. Assisted by Remo Freuler.",
            "Kick Off! Second Half begins Nottingham Forest 0, Chelsea 1.",
            "Half-time First Half ends, Nottingham Forest 0, Chelsea 1.",
            "Attempt saved. Christian Pulisic (Chelsea) right footed shot from the centre of the box is saved in the centre of the goal. Assisted by Kalidou Koulibaly.",
            "Yellow Card! Ryan Yates (Nottingham Forest) is shown the yellow card for a bad foul.",
            "Foul by Ryan Yates (Nottingham Forest).",
            "Denis Zakaria (Chelsea) wins a free kick in the attacking half.",
            "Corner,  Chelsea. Conceded by Taiwo Awoniyi.",
            "Attempt blocked. César Azpilicueta (Chelsea) right footed shot from outside the box is blocked. Assisted by Christian Pulisic.",
            "Foul by Orel Mangala (Nottingham Forest).",
            "Raheem Sterling (Chelsea) wins a free kick in the attacking half.",
            "Foul by Thiago Silva (Chelsea).",
            "Morgan Gibbs-White (Nottingham Forest) wins a free kick in the defensive half.",
            "Foul by Remo Freuler (Nottingham Forest).",
            "Kalidou Koulibaly (Chelsea) wins a free kick in the attacking half.",
            "Mason Mount (Chelsea) wins a free kick in the attacking half.",
            "Foul by Ryan Yates (Nottingham Forest).",
            "Foul by Kai Havertz (Chelsea).",
            "Remo Freuler (Nottingham Forest) wins a free kick in the defensive half.",
            "Thiago Silva (Chelsea) wins a free kick in the defensive half.",
            "Foul by Brennan Johnson (Nottingham Forest).",
            "Foul by Taiwo Awoniyi (Nottingham Forest).",
            "Kalidou Koulibaly (Chelsea) wins a free kick in the defensive half.",
            "Foul by Ryan Yates (Nottingham Forest).",
            "Thiago Silva (Chelsea) wins a free kick in the defensive half.",
            "Morgan Gibbs-White (Nottingham Forest) wins a free kick on the left wing.",
            "Foul by Raheem Sterling (Chelsea).",
            "Corner,  Chelsea. Conceded by Willy Boly.",
            "Attempt blocked. Kai Havertz (Chelsea) left footed shot from the left side of the six yard box is blocked.",
            "Foul by Ryan Yates (Nottingham Forest).",
            "Christian Pulisic (Chelsea) wins a free kick in the attacking half.",
            "Offside, Chelsea. César Azpilicueta tries a through ball, but Kai Havertz is caught offside.",
            "Goal! Goal!  Nottingham Forest 0, Chelsea 1. Raheem Sterling (Chelsea) right footed shot from very close range to the top right corner.",
            "Attempt blocked. Morgan Gibbs-White (Nottingham Forest) right footed shot from the centre of the box is blocked. Assisted by Brennan Johnson.",
            "Marc Cucurella (Chelsea) wins a free kick in the defensive half.",
            "Foul by Brennan Johnson (Nottingham Forest).",
            "Foul by Kalidou Koulibaly (Chelsea).",
            "Taiwo Awoniyi (Nottingham Forest) wins a free kick in the defensive half.",
            "Attempt saved. Brennan Johnson (Nottingham Forest) left footed shot from the left side of the box is saved in the bottom right corner.",
            "Attempt saved. Brennan Johnson (Nottingham Forest) left footed shot from outside the box is saved in the bottom left corner. Assisted by Morgan Gibbs-White with a through ball.",
            "Attempt blocked. Mason Mount (Chelsea) right footed shot from the centre of the box is blocked. Assisted by Raheem Sterling with a cross.",
            "Foul by Mason Mount (Chelsea).",
            "Ryan Yates (Nottingham Forest) wins a free kick in the defensive half.",
            "Attempt missed. Mason Mount (Chelsea) left footed shot from the left side of the box is close, but misses the top left corner. Assisted by Kalidou Koulibaly.",
            "Kick Off! First Half begins.",
            "Lineups are announced and players are warming up."
        ],
        "matchweek": "Matchweek 18",
        "team1_name": "Nottingham Forest",
        "team1_startings": [
            "Dean Henderson",
            "Joe Worrall",
            "Serge Aurier",
            "Willy Boly",
            "Renan Lodi",
            "Orel Mangala",
            "Ryan Yates",
            "Remo Freuler",
            "Taiwo Awoniyi",
            "Morgan Gibbs-White",
            "Brennan Johnson"
        ],
        "team1_subs": [
            "Wayne Hennessey",
            "Steve Cook",
            "Neco Williams",
            "Harry Toffolo",
            "Scott McKenna",
            "Jack Colback",
            "Lewis O'Brien",
            "Sam Surridge",
            "Emmanuel Dennis"
        ],
        "team1_stat": {
            "possession_%": "27.7",
            "shots_on_target": "5",
            "shots": "12",
            "touches": "432",
            "passes": "256",
            "tackels": "18",
            "clearances": "15",
            "corners": "1",
            "offsides": "2",
            "yellow_cards": "2",
            "foul_conceded": "16"
        },
        "team2_name": "Chelsea",
        "team2_startings": [
            "Kepa Arrizabalaga",
            "Thiago Silva",
            "Kalidou Koulibaly",
            "César Azpilicueta",
            "Marc Cucurella",
            "Jorginho",
            "Mason Mount",
            "Denis Zakaria",
            "Christian Pulisic",
            "Raheem Sterling",
            "Kai Havertz"
        ],
        "team2_subs": [
            "Marcus Bettinelli",
            "Trevoh Chalobah",
            "Mateo Kovacic",
            "Hakim Ziyech",
            "Conor Gallagher",
            "Carney Chukwuemeka",
            "Omari Hutchinson",
            "Lewis Hall",
            "Pierre-Emerick Aubameyang"
        ],
        "team2_stat": {
            "possession_%": "72.3",
            "shots_on_target": "2",
            "shots": "7",
            "touches": "867",
            "passes": "697",
            "tackels": "16",
            "clearances": "18",
            "corners": "2",
            "offsides": "2",
            "yellow_cards": "2",
            "foul_conceded": "14"
        }
    },
    "9": {
        "event": [
            "Full-time Match ends, West Ham United 0, Brentford 2.",
            "Second Half ends, West Ham United 0, Brentford 2.",
            "Attempt blocked. Michail Antonio (West Ham United) right footed shot from the right side of the box is blocked. Assisted by Jarrod Bowen.",
            "Substitution Substitution, Brentford. Pontus Jansson replaces Ivan Toney because of an injury.",
            "Corner,  West Ham United. Conceded by Rico Henry.",
            "Substitution Substitution, West Ham United. Tomás Soucek replaces Lucas Paquetá.",
            "Corner,  West Ham United. Conceded by Ivan Toney.",
            "Attempt missed. Craig Dawson (West Ham United) header from very close range misses to the left. Assisted by Jarrod Bowen with a cross following a corner.",
            "Corner,  West Ham United. Conceded by David Raya.",
            "Attempt saved. Craig Dawson (West Ham United) header from the centre of the box is saved in the top centre of the goal. Assisted by Jarrod Bowen with a cross.",
            "Corner,  West Ham United. Conceded by Rico Henry.",
            "Attempt saved. Yoane Wissa (Brentford) right footed shot from the centre of the box is saved in the centre of the goal. Assisted by Mads Roerslev.",
            "Attempt missed. Gianluca Scamacca (West Ham United) right footed shot from outside the box misses to the left. Assisted by Vladimír Coufal.",
            "Attempt saved. Gianluca Scamacca (West Ham United) right footed shot from outside the box is saved in the top centre of the goal. Assisted by Lucas Paquetá.",
            "Foul by Declan Rice (West Ham United).",
            "Christian Nørgaard (Brentford) wins a free kick on the right wing.",
            "Attempt missed. Michail Antonio (West Ham United) header from the centre of the box misses to the right. Assisted by Saïd Benrahma with a cross.",
            "Attempt missed. Ivan Toney (Brentford) right footed shot from the left side of the six yard box is high and wide to the left. Assisted by Ethan Pinnock following a corner.",
            "Attempt missed. Ethan Pinnock (Brentford) header from the right side of the six yard box misses to the left. Assisted by Saman Ghoddos with a cross following a corner.",
            "Corner,  Brentford. Conceded by Lukasz Fabianski.",
            "Attempt saved. Saman Ghoddos (Brentford) left footed shot from the centre of the box is saved in the bottom right corner. Assisted by Christian Nørgaard.",
            "Attempt blocked. Ivan Toney (Brentford) right footed shot from outside the box is blocked.",
            "Yellow Card! Vladimír Coufal (West Ham United) is shown the yellow card for a bad foul.",
            "Foul by Vladimír Coufal (West Ham United).",
            "Yoane Wissa (Brentford) wins a free kick in the attacking half.",
            "Foul by Michail Antonio (West Ham United).",
            "Zanka (Brentford) wins a free kick in the defensive half.",
            "Substitution Substitution, Brentford. Saman Ghoddos replaces Josh Dasilva.",
            "Attempt missed. Craig Dawson (West Ham United) right footed shot from outside the box misses to the right. Assisted by Lucas Paquetá.",
            "Substitution Substitution, West Ham United. Michail Antonio replaces Emerson.",
            "Foul by Vladimír Coufal (West Ham United).",
            "Ivan Toney (Brentford) wins a free kick in the defensive half.",
            "Substitution Substitution, Brentford. Vitaly Janelt replaces Mathias Jensen.",
            "Substitution Substitution, Brentford. Yoane Wissa replaces Bryan Mbeumo.",
            "Attempt saved. Jarrod Bowen (West Ham United) left footed shot from outside the box is saved in the bottom right corner.",
            "Attempt blocked. Emerson (West Ham United) right footed shot from outside the box is blocked. Assisted by Lucas Paquetá.",
            "Foul by Declan Rice (West Ham United).",
            "Josh Dasilva (Brentford) wins a free kick on the right wing.",
            "Attempt missed. Aaron Cresswell (West Ham United) left footed shot from outside the box is too high from a direct free kick.",
            "Jarrod Bowen (West Ham United) wins a free kick in the attacking half.",
            "Foul by Ivan Toney (Brentford).",
            "Foul by Saïd Benrahma (West Ham United).",
            "Mads Roerslev (Brentford) wins a free kick on the right wing.",
            "Attempt blocked. Jarrod Bowen (West Ham United) left footed shot from a difficult angle and long range on the right is blocked.",
            "VAR Decision: No Penalty West Ham United.",
            "Foul by Ben Mee (Brentford).",
            "Jarrod Bowen (West Ham United) wins a free kick in the attacking half.",
            "Kick Off! Second Half begins West Ham United 0, Brentford 2.",
            "Half-time First Half ends, West Ham United 0, Brentford 2.",
            "Attempt missed. Lucas Paquetá (West Ham United) left footed shot from the centre of the box is close, but misses to the right. Assisted by Emerson.",
            "Christian Nørgaard (Brentford) wins a free kick in the defensive half.",
            "Foul by Jarrod Bowen (West Ham United).",
            "Goal! Goal!  West Ham United 0, Brentford 2. Josh Dasilva (Brentford) left footed shot from the right side of the box to the bottom left corner. Assisted by Ivan Toney with a through ball.",
            "Foul by Ivan Toney (Brentford).",
            "Lucas Paquetá (West Ham United) wins a free kick in the defensive half.",
            "Attempt missed. Angelo Ogbonna (West Ham United) header from the centre of the box is high and wide to the left. Assisted by Vladimír Coufal with a cross.",
            "Corner,  West Ham United. Conceded by David Raya.",
            "Attempt saved. Emerson (West Ham United) left footed shot from the left side of the box is saved in the top left corner. Assisted by Angelo Ogbonna.",
            "Corner,  West Ham United. Conceded by Josh Dasilva.",
            "Attempt saved. Gianluca Scamacca (West Ham United) header from the centre of the box is saved in the centre of the goal. Assisted by Vladimír Coufal with a cross.",
            "Foul by Lucas Paquetá (West Ham United).",
            "Ivan Toney (Brentford) wins a free kick in the defensive half.",
            "Ivan Toney (Brentford) wins a free kick in the defensive half.",
            "Foul by Lucas Paquetá (West Ham United).",
            "Attempt blocked. Jarrod Bowen (West Ham United) left footed shot from the centre of the box is blocked. Assisted by Saïd Benrahma.",
            "Goal! Goal!  West Ham United 0, Brentford 1. Ivan Toney (Brentford) right footed shot from very close range to the centre of the goal.",
            "Attempt saved. Christian Nørgaard (Brentford) left footed shot from the centre of the box is saved in the centre of the goal. Assisted by Ethan Pinnock with a headed pass.",
            "Attempt saved. Bryan Mbeumo (Brentford) left footed shot from outside the box is saved in the centre of the goal. Assisted by Ivan Toney with a headed pass.",
            "Attempt blocked. Emerson (West Ham United) left footed shot from the left side of the box is blocked.",
            "Corner,  West Ham United. Conceded by Ethan Pinnock.",
            "Attempt blocked. Jarrod Bowen (West Ham United) right footed shot from the right side of the box is blocked.",
            "Foul by Josh Dasilva (Brentford).",
            "Saïd Benrahma (West Ham United) wins a free kick in the attacking half.",
            "Attempt missed. Craig Dawson (West Ham United) header from the centre of the box is close, but misses to the left. Assisted by Jarrod Bowen with a cross following a corner.",
            "Corner,  West Ham United. Conceded by Ben Mee.",
            "Foul by Zanka (Brentford).",
            "Emerson (West Ham United) wins a free kick in the defensive half.",
            "Declan Rice (West Ham United) hits the right post with a right footed shot from outside the box. Assisted by Saïd Benrahma.",
            "Kick Off! First Half begins.",
            "Lineups are announced and players are warming up."
        ],
        "matchweek": "Matchweek 18",
        "team1_name": "West Ham United",
        "team1_startings": [
            "Lukasz Fabianski",
            "Aaron Cresswell",
            "Craig Dawson",
            "Angelo Ogbonna",
            "Vladimír Coufal",
            "Lucas Paquetá",
            "Emerson",
            "Declan Rice",
            "Gianluca Scamacca",
            "Jarrod Bowen",
            "Saïd Benrahma"
        ],
        "team1_subs": [
            "Alphonse Aréola",
            "Ben Johnson",
            "Thilo Kehrer",
            "Nayef Aguerd",
            "Pablo Fornals",
            "Manuel Lanzini",
            "Flynn Downes",
            "Tomás Soucek",
            "Michail Antonio"
        ],
        "team1_stat": {
            "possession_%": "West",
            "shots_on_target": "63.1",
            "shots": "5",
            "touches": "20",
            "passes": "757",
            "tackels": "570",
            "clearances": "12",
            "corners": "10",
            "offsides": "8",
            "yellow_cards": "1",
            "foul_conceded": "9"
        },
        "team2_name": "Brentford",
        "team2_startings": [
            "David Raya",
            "Ethan Pinnock",
            "Zanka",
            "Ben Mee",
            "Rico Henry",
            "Christian Nørgaard",
            "Mathias Jensen",
            "Josh Dasilva",
            "Mads Roerslev",
            "Ivan Toney",
            "Bryan Mbeumo"
        ],
        "team2_subs": [
            "Matthew Cox",
            "Pontus Jansson",
            "Yoane Wissa",
            "Mikkel Damsgaard",
            "Vitaly Janelt",
            "Ryan Trevitt",
            "Sergi Canós",
            "Saman Ghoddos",
            "Keane Lewis-Potter"
        ],
        "team2_stat": {
            "possession_%": "Brentford",
            "shots_on_target": "36.9",
            "shots": "6",
            "touches": "9",
            "passes": "522",
            "tackels": "348",
            "clearances": "16",
            "corners": "35",
            "offsides": "1",
            "yellow_cards": "0",
            "foul_conceded": "5"
        }
    },
    "10": {
        "event": [
            "Full-time Match ends, Liverpool 2, Leicester City 1.",
            "Second Half ends, Liverpool 2, Leicester City 1.",
            "Offside, Leicester City. Luke Thomas tries a through ball, but Timothy Castagne is caught offside.",
            "Foul by Thiago (Liverpool).",
            "Kelechi Iheanacho (Leicester City) wins a free kick in the attacking half.",
            "Thiago (Liverpool) wins a free kick on the left wing.",
            "Foul by Kelechi Iheanacho (Leicester City).",
            "Foul by Joe Gomez (Liverpool).",
            "Kiernan Dewsbury-Hall (Leicester City) wins a free kick in the defensive half.",
            "Corner,  Liverpool. Conceded by Wout Faes.",
            "Attempt blocked. Konstantinos Tsimikas (Liverpool) left footed shot from outside the box is blocked. Assisted by Naby Keïta.",
            "Substitution Substitution, Liverpool. Stefan Bajcetic replaces Harvey Elliott because of an injury.",
            "Substitution Substitution, Liverpool. Joe Gomez replaces Trent Alexander-Arnold.",
            "Attempt saved. Darwin Núñez (Liverpool) header from the centre of the box is saved in the centre of the goal. Assisted by Konstantinos Tsimikas with a cross.",
            "Corner,  Liverpool. Conceded by Danny Ward.",
            "Attempt saved. Mohamed Salah (Liverpool) left footed shot from the centre of the box is saved in the bottom left corner.",
            "Attempt blocked. Darwin Núñez (Liverpool) right footed shot from outside the box is blocked. Assisted by Thiago.",
            "Offside, Leicester City. Timothy Castagne tries a through ball, but Jamie Vardy is caught offside.",
            "Attempt missed. Naby Keïta (Liverpool) right footed shot from outside the box misses to the left following a set piece situation.",
            "Foul by Youri Tielemans (Leicester City).",
            "Darwin Núñez (Liverpool) wins a free kick on the left wing.",
            "Attempt missed. Darwin Núñez (Liverpool) right footed shot from outside the box is just a bit too high. Assisted by Naby Keïta.",
            "Attempt missed. Kiernan Dewsbury-Hall (Leicester City) left footed shot from outside the box is too high following a corner.",
            "Corner,  Leicester City. Conceded by Joël Matip.",
            "Trent Alexander-Arnold (Liverpool) wins a free kick in the defensive half.",
            "Foul by Harvey Barnes (Leicester City).",
            "Offside, Liverpool. Darwin Núñez tries a through ball, but Mohamed Salah is caught offside.",
            "Thiago (Liverpool) wins a free kick in the defensive half.",
            "Foul by Youri Tielemans (Leicester City).",
            "Attempt saved. Mohamed Salah (Liverpool) right footed shot from the centre of the box is saved in the centre of the goal. Assisted by Virgil van Dijk with a headed pass.",
            "Thiago (Liverpool) wins a free kick in the attacking half.",
            "Foul by Kelechi Iheanacho (Leicester City).",
            "Substitution Substitution, Leicester City. Kelechi Iheanacho replaces Ayoze Pérez.",
            "Harvey Elliott (Liverpool) wins a free kick on the left wing.",
            "Foul by Ayoze Pérez (Leicester City).",
            "Yellow Card! Boubakary Soumaré (Leicester City) is shown the yellow card for a bad foul.",
            "Foul by Boubakary Soumaré (Leicester City).",
            "Thiago (Liverpool) wins a free kick in the defensive half.",
            "Attempt missed. Darwin Núñez (Liverpool) right footed shot from the right side of the box is too high. Assisted by Mohamed Salah.",
            "Thiago (Liverpool) wins a free kick in the defensive half.",
            "Foul by Ayoze Pérez (Leicester City).",
            "Substitution Substitution, Liverpool. Naby Keïta replaces Alex Oxlade-Chamberlain.",
            "Substitution Substitution, Liverpool. Konstantinos Tsimikas replaces Andrew Robertson because of an injury.",
            "Attempt missed. Kiernan Dewsbury-Hall (Leicester City) header from the centre of the box misses to the right. Assisted by Timothy Castagne with a cross.",
            "Attempt blocked. Jamie Vardy (Leicester City) header from the centre of the box is blocked. Assisted by Ayoze Pérez with a cross.",
            "Corner,  Leicester City. Conceded by Virgil van Dijk.",
            "Substitution Substitution, Leicester City. Youri Tielemans replaces Wilfred Ndidi.",
            "Wilfred Ndidi (Leicester City) wins a free kick in the defensive half.",
            "Foul by Darwin Núñez (Liverpool).",
            "Attempt saved. Darwin Núñez (Liverpool) header from the centre of the box is saved in the centre of the goal. Assisted by Trent Alexander-Arnold with a cross.",
            "Attempt blocked. Darwin Núñez (Liverpool) right footed shot from the left side of the box is blocked. Assisted by Thiago.",
            "Attempt saved. Harvey Barnes (Leicester City) right footed shot from the left side of the box is saved in the bottom left corner. Assisted by Luke Thomas.",
            "Attempt missed. Mohamed Salah (Liverpool) right footed shot from the centre of the box is close, but misses to the left. Assisted by Darwin Núñez with a through ball following a fast break.",
            "Offside, Leicester City. Kiernan Dewsbury-Hall tries a through ball, but Harvey Barnes is caught offside.",
            "Foul by Joël Matip (Liverpool).",
            "Boubakary Soumaré (Leicester City) wins a free kick in the defensive half.",
            "Attempt missed. Jordan Henderson (Liverpool) right footed shot from the right side of the box is close, but misses to the left. Assisted by Trent Alexander-Arnold.",
            "Attempt missed. Harvey Barnes (Leicester City) left footed shot from a difficult angle on the left is high and wide to the right. Assisted by Ayoze Pérez.",
            "Kick Off! Second Half begins Liverpool 2, Leicester City 1.",
            "Half-time First Half ends, Liverpool 2, Leicester City 1.",
            "Darwin Núñez (Liverpool) wins a free kick on the left wing.",
            "Foul by Boubakary Soumaré (Leicester City).",
            "Kiernan Dewsbury-Hall (Leicester City) wins a free kick in the defensive half.",
            "Foul by Harvey Elliott (Liverpool).",
            "Harvey Barnes (Leicester City) wins a free kick in the defensive half.",
            "Foul by Harvey Elliott (Liverpool).",
            "Own Goal! Own Goal by Wout Faes, Leicester City.  Liverpool 2, Leicester City 1.",
            "Darwin Núñez (Liverpool) hits the right post with a left footed shot from outside the box. Assisted by Alex Oxlade-Chamberlain following a fast break.",
            "Attempt missed. Trent Alexander-Arnold (Liverpool) left footed shot from outside the box is too high. Assisted by Harvey Elliott.",
            "Offside, Leicester City. Kiernan Dewsbury-Hall tries a through ball, but Jamie Vardy is caught offside.",
            "Foul by Joël Matip (Liverpool).",
            "Harvey Barnes (Leicester City) wins a free kick on the left wing.",
            "Corner,  Liverpool. Conceded by Luke Thomas.",
            "Attempt missed. Virgil van Dijk (Liverpool) header from the centre of the box is close, but misses to the right. Assisted by Andrew Robertson with a cross following a set piece situation.",
            "Foul by Kiernan Dewsbury-Hall (Leicester City).",
            "Mohamed Salah (Liverpool) wins a free kick on the right wing.",
            "Own Goal! Own Goal by Wout Faes, Leicester City.  Liverpool 1, Leicester City 1.",
            "Attempt missed. Alex Oxlade-Chamberlain (Liverpool) right footed shot from the centre of the box misses to the right. Assisted by Andrew Robertson with a cross.",
            "Attempt saved. Jordan Henderson (Liverpool) right footed shot from outside the box is saved in the centre of the goal.",
            "Corner,  Leicester City. Conceded by Virgil van Dijk.",
            "Offside, Leicester City. Kiernan Dewsbury-Hall tries a through ball, but Harvey Barnes is caught offside.",
            "Mohamed Salah (Liverpool) wins a free kick on the right wing.",
            "Foul by Wout Faes (Leicester City).",
            "Offside, Liverpool. Mohamed Salah tries a through ball, but Alex Oxlade-Chamberlain is caught offside.",
            "Attempt missed. Mohamed Salah (Liverpool) left footed shot from the centre of the box is close, but misses to the left. Assisted by Darwin Núñez following a fast break.",
            "Corner,  Leicester City. Conceded by Alex Oxlade-Chamberlain.",
            "Attempt blocked. Wilfred Ndidi (Leicester City) header from the centre of the box is blocked. Assisted by Ayoze Pérez with a cross.",
            "Corner,  Leicester City. Conceded by Trent Alexander-Arnold.",
            "Harvey Elliott (Liverpool) wins a free kick in the attacking half.",
            "Foul by Luke Thomas (Leicester City).",
            "Attempt blocked. Trent Alexander-Arnold (Liverpool) right footed shot from outside the box is blocked.",
            "Attempt blocked. Trent Alexander-Arnold (Liverpool) right footed shot from outside the box is blocked.",
            "Substitution Substitution, Leicester City. Jamie Vardy replaces Patson Daka because of an injury.",
            "Foul by Luke Thomas (Leicester City).",
            "Darwin Núñez (Liverpool) wins a free kick in the attacking half.",
            "Corner,  Liverpool. Conceded by Daniel Amartey.",
            "Foul by Andrew Robertson (Liverpool).",
            "Ayoze Pérez (Leicester City) wins a free kick in the attacking half.",
            "Foul by Kiernan Dewsbury-Hall (Leicester City).",
            "Harvey Elliott (Liverpool) wins a free kick in the attacking half.",
            "Attempt blocked. Thiago (Liverpool) left footed shot from the centre of the box is blocked.",
            "Goal! Goal!  Liverpool 0, Leicester City 1. Kiernan Dewsbury-Hall (Leicester City) left footed shot from the centre of the box to the bottom left corner. Assisted by Patson Daka.",
            "Foul by Wilfred Ndidi (Leicester City).",
            "Thiago (Liverpool) wins a free kick in the defensive half.",
            "Kick Off! First Half begins.",
            "Lineups are announced and players are warming up."
        ],
        "matchweek": "Matchweek 18",
        "team1_name": "Liverpool",
        "team1_startings": [
            "Alisson",
            "Virgil van Dijk",
            "Andrew Robertson",
            "Joël Matip",
            "Trent Alexander-Arnold",
            "Thiago",
            "Jordan Henderson",
            "Harvey Elliott",
            "Mohamed Salah",
            "Alex Oxlade-Chamberlain",
            "Darwin Núñez"
        ],
        "team1_subs": [
            "Adrián",
            "Joe Gomez",
            "Ibrahima Konaté",
            "Konstantinos Tsimikas",
            "Stefan Bajcetic",
            "Naby Keïta",
            "Fábio Carvalho",
            "Bobby Clark",
            "Ben Doak"
        ],
        "team1_stat": {
            "possession_%": "57",
            "shots_on_target": "5",
            "shots": "21",
            "touches": "779",
            "passes": "588",
            "tackels": "18",
            "clearances": "10",
            "corners": "4",
            "offsides": "2",
            "yellow_cards": "0",
            "foul_conceded": "8"
        },
        "team2_name": "Leicester City",
        "team2_startings": [
            "Danny Ward",
            "Wout Faes",
            "Daniel Amartey",
            "Timothy Castagne",
            "Luke Thomas",
            "Harvey Barnes",
            "Ayoze Pérez",
            "Kiernan Dewsbury-Hall",
            "Wilfred Ndidi",
            "Boubakary Soumaré",
            "Patson Daka"
        ],
        "team2_subs": [
            "Daniel Iversen",
            "Çaglar Söyüncü",
            "Jannik Vestergaard",
            "Youri Tielemans",
            "Marc Albrighton",
            "Nampalys Mendy",
            "Lewis Brunt",
            "Jamie Vardy",
            "Kelechi Iheanacho"
        ],
        "team2_stat": {
            "possession_%": "43",
            "shots_on_target": "2",
            "shots": "7",
            "touches": "640",
            "passes": "448",
            "tackels": "14",
            "clearances": "20",
            "corners": "5",
            "offsides": "5",
            "yellow_cards": "1",
            "foul_conceded": "15"
        }
    },
    "11": {
        "event": [
            "Full-time Match ends, Wolverhampton Wanderers 0, Manchester United 1.",
            "Second Half ends, Wolverhampton Wanderers 0, Manchester United 1.",
            "Foul by Toti (Wolverhampton Wanderers).",
            "Aaron Wan-Bissaka (Manchester United) wins a free kick in the defensive half.",
            "Corner,  Wolverhampton Wanderers. Conceded by Harry Maguire.",
            "Attempt saved. Raúl Jiménez (Wolverhampton Wanderers) header from the centre of the box is saved in the centre of the goal. Assisted by Rayan Aït-Nouri with a cross.",
            "Corner,  Wolverhampton Wanderers. Conceded by Aaron Wan-Bissaka.",
            "Substitution Substitution, Manchester United. Anthony Elanga replaces Antony.",
            "Substitution Substitution, Manchester United. Harry Maguire replaces Bruno Fernandes.",
            "Corner,  Wolverhampton Wanderers. Conceded by Raphaël Varane.",
            "Attempt blocked. Raúl Jiménez (Wolverhampton Wanderers) header from the centre of the box is blocked. Assisted by Jonny with a cross.",
            "Matheus Nunes (Wolverhampton Wanderers) wins a free kick in the attacking half.",
            "Foul by Donny van de Beek (Manchester United).",
            "Rayan Aït-Nouri (Wolverhampton Wanderers) wins a free kick in the defensive half.",
            "Foul by Tyrell Malacia (Manchester United).",
            "Attempt saved. Bruno Fernandes (Manchester United) right footed shot from outside the box is saved in the top left corner. Assisted by Donny van de Beek.",
            "Yellow Card! Marcus Rashford (Manchester United) is shown the yellow card.",
            "Foul by Luke Shaw (Manchester United).",
            "Raúl Jiménez (Wolverhampton Wanderers) wins a free kick in the defensive half.",
            "Casemiro (Manchester United) wins a free kick in the defensive half.",
            "Foul by Rayan Aït-Nouri (Wolverhampton Wanderers).",
            "Donny van de Beek (Manchester United) wins a free kick in the defensive half.",
            "Foul by Raúl Jiménez (Wolverhampton Wanderers).",
            "VAR Decision: No Goal  Wolverhampton Wanderers 0-1 Manchester United.",
            "Hand ball by Marcus Rashford (Manchester United).",
            "GOAL OVERTURNED BY VAR: Marcus Rashford (Manchester United) scores but the goal is ruled out after a VAR review.",
            "Attempt saved. Marcus Rashford (Manchester United) right footed shot from the right side of the six yard box is saved in the bottom right corner. Assisted by Aaron Wan-Bissaka.",
            "Substitution Substitution, Manchester United. Donny van de Beek replaces Anthony Martial.",
            "Substitution Substitution, Wolverhampton Wanderers. Raúl Jiménez replaces Daniel Podence.",
            "Foul by Rúben Neves (Wolverhampton Wanderers).",
            "Fred (Manchester United) wins a free kick in the defensive half.",
            "Foul by Daniel Podence (Wolverhampton Wanderers).",
            "Casemiro (Manchester United) wins a free kick in the defensive half.",
            "Goal! Goal!  Wolverhampton Wanderers 0, Manchester United 1. Marcus Rashford (Manchester United) right footed shot from the centre of the box to the centre of the goal. Assisted by Bruno Fernandes.",
            "Attempt blocked. Rúben Neves (Wolverhampton Wanderers) right footed shot from outside the box is blocked.",
            "Substitution Substitution, Wolverhampton Wanderers. Toti replaces Hugo Bueno.",
            "Substitution Substitution, Wolverhampton Wanderers. Rayan Aït-Nouri replaces João Moutinho.",
            "Yellow Card! Fred (Manchester United) is shown the yellow card for a bad foul.",
            "Nathan Collins (Wolverhampton Wanderers) wins a free kick in the attacking half.",
            "Foul by Fred (Manchester United).",
            "Foul by Fred (Manchester United).",
            "Matheus Nunes (Wolverhampton Wanderers) wins a free kick in the defensive half.",
            "Attempt missed. Casemiro (Manchester United) left footed shot from outside the box misses to the left.",
            "Substitution Substitution, Wolverhampton Wanderers. Jonny replaces Nélson Semedo.",
            "Corner,  Manchester United. Conceded by Nathan Collins.",
            "Corner,  Manchester United. Conceded by Maximilian Kilman.",
            "Substitution Substitution, Manchester United. Fred replaces Christian Eriksen.",
            "Offside, Manchester United. Casemiro tries a through ball, but Bruno Fernandes is caught offside.",
            "Corner,  Wolverhampton Wanderers. Conceded by David de Gea.",
            "Attempt saved. Rúben Neves (Wolverhampton Wanderers) right footed shot from outside the box is saved in the top right corner.",
            "Yellow Card! Casemiro (Manchester United) is shown the yellow card for a bad foul.",
            "Foul by Casemiro (Manchester United).",
            "Daniel Podence (Wolverhampton Wanderers) wins a free kick in the attacking half.",
            "Attempt missed. Bruno Fernandes (Manchester United) right footed shot from outside the box is high and wide to the right from a direct free kick.",
            "Foul by João Moutinho (Wolverhampton Wanderers).",
            "Bruno Fernandes (Manchester United) wins a free kick in the attacking half.",
            "Attempt saved. Antony (Manchester United) left footed shot from the right side of the six yard box is saved in the centre of the goal.",
            "Attempt blocked. Bruno Fernandes (Manchester United) right footed shot from the centre of the box is blocked. Assisted by Anthony Martial.",
            "Attempt missed. Antony (Manchester United) left footed shot from the right side of the box misses to the left. Assisted by Bruno Fernandes with a headed pass.",
            "Attempt blocked. Antony (Manchester United) left footed shot from outside the box is blocked. Assisted by Bruno Fernandes.",
            "Foul by Bruno Fernandes (Manchester United).",
            "Matheus Nunes (Wolverhampton Wanderers) wins a free kick on the left wing.",
            "Attempt missed. Nathan Collins (Wolverhampton Wanderers) header from the centre of the box misses to the left. Assisted by Hugo Bueno with a cross following a corner.",
            "Corner,  Wolverhampton Wanderers. Conceded by Tyrell Malacia.",
            "Substitution Substitution, Wolverhampton Wanderers. Adama Traoré replaces Diego Costa.",
            "Kick Off! Second Half begins Wolverhampton Wanderers 0, Manchester United 0.",
            "Substitution Substitution, Manchester United. Marcus Rashford replaces Alejandro Garnacho.",
            "Half-time First Half ends, Wolverhampton Wanderers 0, Manchester United 0.",
            "Offside, Manchester United. Anthony Martial tries a through ball, but Antony is caught offside.",
            "Attempt missed. Anthony Martial (Manchester United) header from very close range misses to the right.",
            "Foul by Casemiro (Manchester United).",
            "Rúben Neves (Wolverhampton Wanderers) wins a free kick in the defensive half.",
            "Attempt saved. Antony (Manchester United) header from the centre of the box is saved in the centre of the goal. Assisted by Tyrell Malacia with a cross.",
            "Attempt blocked. Daniel Podence (Wolverhampton Wanderers) left footed shot from the left side of the box is blocked. Assisted by Hwang Hee-Chan with a cross.",
            "Corner,  Wolverhampton Wanderers. Conceded by Luke Shaw.",
            "Attempt blocked. Rúben Neves (Wolverhampton Wanderers) right footed shot from the right side of the box is blocked. Assisted by Daniel Podence with a cross.",
            "Corner,  Manchester United. Conceded by Nathan Collins.",
            "Attempt blocked. Anthony Martial (Manchester United) left footed shot from the centre of the box is blocked. Assisted by Bruno Fernandes.",
            "Foul by Diego Costa (Wolverhampton Wanderers).",
            "Luke Shaw (Manchester United) wins a free kick in the defensive half.",
            "Yellow Card! Nélson Semedo (Wolverhampton Wanderers) is shown the yellow card for a bad foul.",
            "Foul by Nélson Semedo (Wolverhampton Wanderers).",
            "Alejandro Garnacho (Manchester United) wins a free kick in the attacking half.",
            "Attempt saved. Diego Costa (Wolverhampton Wanderers) right footed shot from the left side of the box is saved in the centre of the goal. Assisted by Matheus Nunes.",
            "Attempt blocked. João Moutinho (Wolverhampton Wanderers) right footed shot from the centre of the box is blocked. Assisted by Diego Costa.",
            "Attempt blocked. Daniel Podence (Wolverhampton Wanderers) right footed shot from the left side of the box is blocked. Assisted by João Moutinho.",
            "Attempt blocked. Antony (Manchester United) left footed shot from the right side of the box is blocked.",
            "Nélson Semedo (Wolverhampton Wanderers) wins a free kick in the defensive half.",
            "Foul by Alejandro Garnacho (Manchester United).",
            "Foul by Diego Costa (Wolverhampton Wanderers).",
            "Casemiro (Manchester United) wins a free kick in the defensive half.",
            "Attempt saved. Alejandro Garnacho (Manchester United) right footed shot from the centre of the box is saved in the bottom right corner.",
            "Corner,  Wolverhampton Wanderers. Conceded by Raphaël Varane.",
            "Foul by Hwang Hee-Chan (Wolverhampton Wanderers).",
            "Tyrell Malacia (Manchester United) wins a free kick in the defensive half.",
            "Attempt missed. Alejandro Garnacho (Manchester United) right footed shot from outside the box is high and wide to the right following a corner.",
            "Corner,  Manchester United. Conceded by Matheus Nunes.",
            "Attempt blocked. Casemiro (Manchester United) header from the centre of the box is blocked. Assisted by Christian Eriksen with a cross.",
            "Corner,  Manchester United. Conceded by Rúben Neves.",
            "Offside, Wolverhampton Wanderers. Hwang Hee-Chan tries a through ball, but Diego Costa is caught offside.",
            "Foul by Alejandro Garnacho (Manchester United).",
            "Nélson Semedo (Wolverhampton Wanderers) wins a free kick on the right wing.",
            "Casemiro (Manchester United) wins a free kick in the defensive half.",
            "Foul by Nathan Collins (Wolverhampton Wanderers).",
            "Kick Off! First Half begins.",
            "Lineups are announced and players are warming up."
        ],
        "matchweek": "Matchweek 18",
        "team1_name": "Wolverhampton Wanderers",
        "team1_startings": [
            "José Sá",
            "Nathan Collins",
            "Nélson Semedo",
            "Maximilian Kilman",
            "Hugo Bueno",
            "Rúben Neves",
            "Daniel Podence",
            "Hwang Hee-Chan",
            "Matheus Nunes",
            "João Moutinho",
            "Diego Costa"
        ],
        "team1_subs": [
            "Matija Sarkic",
            "Rayan Aït-Nouri",
            "Jonny",
            "Toti",
            "Boubacar Traoré",
            "Joseph Hodge",
            "Raúl Jiménez",
            "Gonçalo Guedes",
            "Adama Traoré"
        ],
        "team1_stat": {
            "possession_%": "45.7",
            "shots_on_target": "3",
            "shots": "10",
            "touches": "585",
            "passes": "394",
            "tackels": "16",
            "clearances": "11",
            "corners": "7",
            "offsides": "1",
            "yellow_cards": "1",
            "foul_conceded": "11"
        },
        "team2_name": "Manchester United",
        "team2_startings": [
            "David de Gea",
            "Tyrell Malacia",
            "Raphaël Varane",
            "Luke Shaw",
            "Aaron Wan-Bissaka",
            "Bruno Fernandes",
            "Christian Eriksen",
            "Casemiro",
            "Antony",
            "Alejandro Garnacho",
            "Anthony Martial"
        ],
        "team2_subs": [
            "Tom Heaton",
            "Victor Lindelöf",
            "Harry Maguire",
            "Brandon Williams",
            "Fred",
            "Donny van de Beek",
            "Kobbie Mainoo",
            "Marcus Rashford",
            "Anthony Elanga"
        ],
        "team2_stat": {
            "possession_%": "54.3",
            "shots_on_target": "6",
            "shots": "16",
            "touches": "671",
            "passes": "484",
            "tackels": "17",
            "clearances": "21",
            "corners": "5",
            "offsides": "2",
            "yellow_cards": "3",
            "foul_conceded": "11"
        }
    },
    "12": {
        "event": [
            "Full-time Match ends, Bournemouth 0, Crystal Palace 2.",
            "Second Half ends, Bournemouth 0, Crystal Palace 2.",
            "Foul by Will Hughes (Crystal Palace).",
            "Dominic Solanke (Bournemouth) wins a free kick in the defensive half.",
            "Marc Guéhi (Crystal Palace) wins a free kick in the defensive half.",
            "Foul by Kieffer Moore (Bournemouth).",
            "Offside, Bournemouth. Lloyd Kelly tries a through ball, but Dominic Solanke is caught offside.",
            "Yellow Card! Marcos Senesi (Bournemouth) is shown the yellow card for a bad foul.",
            "Wilfried Zaha (Crystal Palace) wins a free kick on the right wing.",
            "Foul by Marcos Senesi (Bournemouth).",
            "Corner,  Crystal Palace. Conceded by Adam Smith.",
            "Attempt blocked. Wilfried Zaha (Crystal Palace) right footed shot from the centre of the box is blocked. Assisted by Jean-Philippe Mateta.",
            "Attempt saved. Odsonne Édouard (Crystal Palace) left footed shot from the left side of the six yard box is saved in the bottom left corner. Assisted by Wilfried Zaha.",
            "Substitution Substitution, Crystal Palace. Will Hughes replaces Michael Olise.",
            "Yellow Card! Joachim Andersen (Crystal Palace) is shown the yellow card for a bad foul.",
            "Siriki Dembélé (Bournemouth) wins a free kick in the defensive half.",
            "Foul by Joachim Andersen (Crystal Palace).",
            "Wilfried Zaha (Crystal Palace) wins a free kick on the left wing.",
            "Foul by Marcos Senesi (Bournemouth).",
            "Attempt saved. Siriki Dembélé (Bournemouth) right footed shot from outside the box is saved in the top centre of the goal. Assisted by Dominic Solanke.",
            "Attempt missed. Jean-Philippe Mateta (Crystal Palace) right footed shot from the centre of the box is just a bit too high. Assisted by Jeffrey Schlupp.",
            "Substitution Substitution, Bournemouth. Ryan Christie replaces Jaidon Anthony.",
            "Substitution Substitution, Bournemouth. Jamal Lowe replaces Lewis Cook.",
            "Offside, Crystal Palace. Odsonne Édouard tries a through ball, but Jean-Philippe Mateta is caught offside.",
            "Adam Smith (Bournemouth) wins a free kick in the defensive half.",
            "Foul by Jean-Philippe Mateta (Crystal Palace).",
            "Substitution Substitution, Crystal Palace. Odsonne Édouard replaces Eberechi Eze.",
            "Substitution Substitution, Crystal Palace. Jean-Philippe Mateta replaces Jordan Ayew.",
            "Jordan Ayew (Crystal Palace) wins a free kick in the defensive half.",
            "Foul by Marcos Senesi (Bournemouth).",
            "Substitution Substitution, Bournemouth. Joe Rothwell replaces Jordan Zemura.",
            "Attempt blocked. Cheick Oumar Doucouré (Crystal Palace) right footed shot from outside the box is blocked.",
            "Corner,  Crystal Palace. Conceded by Jordan Zemura.",
            "Corner,  Crystal Palace. Conceded by Lloyd Kelly.",
            "Yellow Card! Dominic Solanke (Bournemouth) is shown the yellow card for a bad foul.",
            "Michael Olise (Crystal Palace) wins a free kick in the defensive half.",
            "Foul by Dominic Solanke (Bournemouth).",
            "Michael Olise (Crystal Palace) wins a free kick in the defensive half.",
            "Foul by Kieffer Moore (Bournemouth).",
            "Dominic Solanke (Bournemouth) wins a free kick in the attacking half.",
            "Foul by Jeffrey Schlupp (Crystal Palace).",
            "Attempt missed. Kieffer Moore (Bournemouth) header from the centre of the box misses to the left. Assisted by Jaidon Anthony with a cross following a set piece situation.",
            "Foul by Eberechi Eze (Crystal Palace).",
            "Lewis Cook (Bournemouth) wins a free kick on the right wing.",
            "Corner,  Bournemouth. Conceded by Nathaniel Clyne.",
            "Corner,  Crystal Palace. Conceded by Mark Travers.",
            "Attempt saved. Eberechi Eze (Crystal Palace) right footed shot from long range on the left is saved in the top right corner.",
            "Joel Ward (Crystal Palace) wins a free kick on the left wing.",
            "Foul by Jefferson Lerma (Bournemouth).",
            "Attempt missed. Kieffer Moore (Bournemouth) header from the centre of the box misses to the left.",
            "Attempt saved. Dominic Solanke (Bournemouth) right footed shot from the centre of the box is saved in the top right corner. Assisted by Siriki Dembélé.",
            "Michael Olise (Crystal Palace) wins a free kick on the right wing.",
            "Foul by Jordan Zemura (Bournemouth).",
            "Attempt blocked. Dominic Solanke (Bournemouth) right footed shot from the right side of the box is blocked. Assisted by Siriki Dembélé with a cross.",
            "Jordan Ayew (Crystal Palace) wins a free kick in the defensive half.",
            "Foul by Siriki Dembélé (Bournemouth).",
            "Kick Off! Second Half begins Bournemouth 0, Crystal Palace 2.",
            "Half-time First Half ends, Bournemouth 0, Crystal Palace 2.",
            "Foul by Cheick Oumar Doucouré (Crystal Palace).",
            "Kieffer Moore (Bournemouth) wins a free kick in the attacking half.",
            "Foul by Adam Smith (Bournemouth).",
            "Jordan Ayew (Crystal Palace) wins a free kick in the defensive half.",
            "Attempt missed. Lewis Cook (Bournemouth) left footed shot from outside the box misses to the right. Assisted by Siriki Dembélé.",
            "Substitution Substitution, Bournemouth. Siriki Dembélé replaces Philip Billing because of an injury.",
            "Goal! Goal!  Bournemouth 0, Crystal Palace 2. Eberechi Eze (Crystal Palace) right footed shot from outside the box to the bottom left corner. Assisted by Michael Olise   following a corner.",
            "Corner,  Crystal Palace. Conceded by Philip Billing.",
            "Jordan Ayew (Crystal Palace) wins a free kick in the defensive half.",
            "Foul by Lloyd Kelly (Bournemouth).",
            "Jefferson Lerma (Bournemouth) wins a free kick on the right wing.",
            "Foul by Eberechi Eze (Crystal Palace).",
            "Dominic Solanke (Bournemouth) wins a free kick in the defensive half.",
            "Foul by Jeffrey Schlupp (Crystal Palace).",
            "Jordan Ayew (Crystal Palace) wins a free kick on the right wing.",
            "Foul by Lloyd Kelly (Bournemouth).",
            "Attempt blocked. Eberechi Eze (Crystal Palace) right footed shot from outside the box is blocked. Assisted by Michael Olise.",
            "Yellow Card! Jaidon Anthony (Bournemouth) is shown the yellow card for a bad foul.",
            "Foul by Jaidon Anthony (Bournemouth).",
            "Michael Olise (Crystal Palace) wins a free kick on the right wing.",
            "Yellow Card! Lloyd Kelly (Bournemouth) is shown the yellow card.",
            "Jefferson Lerma (Bournemouth) wins a free kick in the defensive half.",
            "Foul by Eberechi Eze (Crystal Palace).",
            "Goal! Goal!  Bournemouth 0, Crystal Palace 1. Jordan Ayew (Crystal Palace) header from very close range to the bottom right corner. Assisted by Michael Olise with a cross   following a corner.",
            "Corner,  Crystal Palace. Conceded by Lloyd Kelly.",
            "Attempt blocked. Jordan Ayew (Crystal Palace) left footed shot from the left side of the box is blocked. Assisted by Wilfried Zaha.",
            "Foul by Jeffrey Schlupp (Crystal Palace).",
            "Kieffer Moore (Bournemouth) wins a free kick in the attacking half.",
            "Attempt saved. Cheick Oumar Doucouré (Crystal Palace) right footed shot from outside the box is saved in the centre of the goal. Assisted by Eberechi Eze.",
            "Attempt blocked. Michael Olise (Crystal Palace) left footed shot from outside the box is blocked. Assisted by Eberechi Eze.",
            "Attempt missed. Eberechi Eze (Crystal Palace) left footed shot from outside the box is too high following a corner.",
            "Attempt missed. Cheick Oumar Doucouré (Crystal Palace) right footed shot from outside the box is close, but misses to the right following a corner.",
            "Corner,  Crystal Palace. Conceded by Lloyd Kelly.",
            "Attempt saved. Marc Guéhi (Crystal Palace) with an attempt from the centre of the box is saved in the centre of the goal. Assisted by Eberechi Eze.",
            "Foul by Philip Billing (Bournemouth).",
            "Cheick Oumar Doucouré (Crystal Palace) wins a free kick in the attacking half.",
            "Attempt missed. Jeffrey Schlupp (Crystal Palace) left footed shot from outside the box is too high.",
            "Foul by Lewis Cook (Bournemouth).",
            "Eberechi Eze (Crystal Palace) wins a free kick in the defensive half.",
            "Corner,  Bournemouth. Conceded by Nathaniel Clyne.",
            "Adam Smith (Bournemouth) wins a free kick in the defensive half.",
            "Foul by Wilfried Zaha (Crystal Palace).",
            "Foul by Jefferson Lerma (Bournemouth).",
            "Jordan Ayew (Crystal Palace) wins a free kick on the left wing.",
            "Joel Ward (Crystal Palace) wins a free kick in the defensive half.",
            "Foul by Dominic Solanke (Bournemouth).",
            "Kick Off! First Half begins.",
            "Lineups are announced and players are warming up."
        ],
        "matchweek": "Matchweek 18",
        "team1_name": "Bournemouth",
        "team1_startings": [
            "Mark Travers",
            "Lloyd Kelly",
            "Adam Smith",
            "Marcos Senesi",
            "Jordan Zemura",
            "Lewis Cook",
            "Jefferson Lerma",
            "Philip Billing",
            "Jaidon Anthony",
            "Dominic Solanke",
            "Kieffer Moore"
        ],
        "team1_subs": [
            "Cameron Plain",
            "Jack Stephens",
            "Chris Mepham",
            "Jack Stacey",
            "Ryan Christie",
            "Joe Rothwell",
            "Siriki Dembélé",
            "Ben Pearson",
            "Jamal Lowe"
        ],
        "team1_stat": {
            "possession_%": "58.9",
            "shots_on_target": "2",
            "shots": "6",
            "touches": "676",
            "passes": "455",
            "tackels": "17",
            "clearances": "17",
            "corners": "2",
            "offsides": "1",
            "yellow_cards": "4",
            "foul_conceded": "17"
        },
        "team2_name": "Crystal Palace",
        "team2_startings": [
            "Vicente Guaita",
            "Joel Ward",
            "Marc Guéhi",
            "Joachim Andersen",
            "Nathaniel Clyne",
            "Michael Olise",
            "Eberechi Eze",
            "Wilfried Zaha",
            "Jeffrey Schlupp",
            "Cheick Oumar Doucouré",
            "Jordan Ayew"
        ],
        "team2_subs": [
            "Jack Butland",
            "Chris Richards",
            "Will Hughes",
            "Malcolm Ebiowei",
            "Jairo Riedewald",
            "David Ozoh",
            "Jean-Philippe Mateta",
            "Odsonne Édouard",
            "John-Kymani Gordon"
        ],
        "team2_stat": {
            "possession_%": "41.1",
            "shots_on_target": "6",
            "shots": "15",
            "touches": "557",
            "passes": "317",
            "tackels": "31",
            "clearances": "22",
            "corners": "7",
            "offsides": "1",
            "yellow_cards": "1",
            "foul_conceded": "11"
        }
    },
    "13": {
        "event": [
            "Full-time Match ends, Fulham 2, Southampton 1.",
            "Second Half ends, Fulham 2, Southampton 1.",
            "Substitution Substitution, Fulham. Tosin Adarabioyo replaces Andreas Pereira.",
            "Corner,  Fulham. Conceded by Gavin Bazunu.",
            "Pen. Saved! Penalty saved! Aleksandar Mitrovic (Fulham) fails to capitalise on this great opportunity,  right footed shot saved  in the bottom right corner.",
            "Penalty Fulham. Dan James draws a foul in the penalty area.",
            "Penalty conceded by Gavin Bazunu (Southampton) after a foul in the penalty area.",
            "Substitution Substitution, Southampton. Sékou Mara replaces Mohamed Elyounoussi.",
            "Substitution Substitution, Southampton. Adam Armstrong replaces Ainsley Maitland-Niles.",
            "Substitution Substitution, Southampton. Roméo Lavia replaces Mohammed Salisu.",
            "Goal! Goal!  Fulham 2, Southampton 1. João Palhinha (Fulham) header from the right side of the six yard box to the bottom right corner. Assisted by Kenny Tete with a headed pass   following a corner.",
            "Corner,  Fulham. Conceded by James Ward-Prowse.",
            "Corner,  Fulham. Conceded by Mohamed Elyounoussi.",
            "Foul by Mohammed Salisu (Southampton).",
            "Dan James (Fulham) wins a free kick on the right wing.",
            "João Palhinha (Fulham) wins a free kick in the defensive half.",
            "Foul by Stuart Armstrong (Southampton).",
            "Substitution Substitution, Southampton. Romain Perraud replaces Samuel Edozie because of an injury.",
            "Kenny Tete (Fulham) wins a free kick on the right wing.",
            "Foul by Stuart Armstrong (Southampton).",
            "Attempt missed. Lyanco (Southampton) right footed shot from more than 35 yards is high and wide to the right.",
            "Attempt missed. Kenny Tete (Fulham) left footed shot from the centre of the box is high and wide to the left.",
            "Samuel Edozie (Southampton) wins a free kick in the attacking half.",
            "Foul by Willian (Fulham).",
            "Corner,  Southampton. Conceded by Kenny Tete.",
            "Foul by Kyle Walker-Peters (Southampton).",
            "Antonee Robinson (Fulham) wins a free kick in the defensive half.",
            "Attempt blocked. Stuart Armstrong (Southampton) right footed shot from outside the box is blocked. Assisted by Mohamed Elyounoussi.",
            "Yellow Card! Mohamed Elyounoussi (Southampton) is shown the yellow card for a bad foul.",
            "Foul by Mohamed Elyounoussi (Southampton).",
            "Antonee Robinson (Fulham) wins a free kick in the defensive half.",
            "Corner,  Southampton. Conceded by Kenny Tete.",
            "Hand ball by Kenny Tete (Fulham).",
            "Substitution Substitution, Southampton. Stuart Armstrong replaces Joe Aribo.",
            "Substitution Substitution, Fulham. Dan James replaces Bobby De Cordova-Reid.",
            "Substitution Substitution, Fulham. Tom Cairney replaces Harrison Reed.",
            "Foul by Mohamed Elyounoussi (Southampton).",
            "João Palhinha (Fulham) wins a free kick in the defensive half.",
            "Goal! Goal!  Fulham 1, Southampton 1. James Ward-Prowse (Southampton) from a free kick with a right footed shot to the bottom right corner.",
            "Che Adams (Southampton) wins a free kick in the attacking half.",
            "Foul by Bobby De Cordova-Reid (Fulham).",
            "Attempt missed. Andreas Pereira (Fulham) right footed shot from the right side of the six yard box is close, but misses to the right. Assisted by Bobby De Cordova-Reid with a cross.",
            "Kick Off! Second Half begins Fulham 1, Southampton 0.",
            "Half-time First Half ends, Fulham 1, Southampton 0.",
            "Aleksandar Mitrovic (Fulham) wins a free kick on the left wing.",
            "Foul by Lyanco (Southampton).",
            "Foul by Aleksandar Mitrovic (Fulham).",
            "Armel Bella-Kotchap (Southampton) wins a free kick in the defensive half.",
            "Foul by Aleksandar Mitrovic (Fulham).",
            "Lyanco (Southampton) wins a free kick in the defensive half.",
            "Attempt missed. Mohammed Salisu (Southampton) header from the centre of the box is too high. Assisted by James Ward-Prowse with a cross following a corner.",
            "Corner,  Southampton. Conceded by Kenny Tete.",
            "Aleksandar Mitrovic (Fulham) wins a free kick in the defensive half.",
            "Foul by James Ward-Prowse (Southampton).",
            "Attempt missed. Aleksandar Mitrovic (Fulham) right footed shot from outside the box is too high. Assisted by Willian.",
            "Hand ball by Andreas Pereira (Fulham).",
            "Own Goal! Own Goal by James Ward-Prowse, Southampton.  Fulham 1, Southampton 0.",
            "Attempt missed. Andreas Pereira (Fulham) right footed shot from outside the box misses to the left. Assisted by Willian following a corner.",
            "Corner,  Fulham. Conceded by Armel Bella-Kotchap.",
            "Attempt missed. Mohamed Elyounoussi (Southampton) right footed shot from outside the box is just a bit too high. Assisted by Lyanco.",
            "Attempt saved. Samuel Edozie (Southampton) right footed shot from outside the box is saved in the centre of the goal. Assisted by Che Adams.",
            "Foul by Harrison Reed (Fulham).",
            "Joe Aribo (Southampton) wins a free kick in the defensive half.",
            "Attempt blocked. João Palhinha (Fulham) right footed shot from outside the box is blocked.",
            "Hand ball by Samuel Edozie (Southampton).",
            "Attempt blocked. Che Adams (Southampton) right footed shot from a difficult angle on the left is blocked. Assisted by Armel Bella-Kotchap.",
            "Corner,  Southampton. Conceded by Bernd Leno.",
            "Attempt saved. Che Adams (Southampton) right footed shot from the left side of the box is saved in the centre of the goal. Assisted by Mohamed Elyounoussi.",
            "Offside, Fulham. Tim Ream tries a through ball, but Willian is caught offside.",
            "Foul by Lyanco (Southampton).",
            "Andreas Pereira (Fulham) wins a free kick in the attacking half.",
            "Attempt missed. Willian (Fulham) right footed shot from the centre of the box is close, but misses to the left.",
            "Che Adams (Southampton) wins a free kick in the attacking half.",
            "Foul by Issa Diop (Fulham).",
            "João Palhinha (Fulham) wins a free kick in the defensive half.",
            "Foul by James Ward-Prowse (Southampton).",
            "Attempt missed. Che Adams (Southampton) right footed shot from more than 35 yards misses to the right.",
            "Hand ball by Kyle Walker-Peters (Southampton).",
            "Kick Off! First Half begins.",
            "Lineups are announced and players are warming up."
        ],
        "matchweek": "Matchweek 18",
        "team1_name": "Fulham",
        "team1_startings": [
            "Bernd Leno",
            "Kenny Tete",
            "Tim Ream",
            "Issa Diop",
            "Antonee Robinson",
            "Harrison Reed",
            "Bobby De Cordova-Reid",
            "Andreas Pereira",
            "Willian",
            "João Palhinha",
            "Aleksandar Mitrovic"
        ],
        "team1_subs": [
            "Marek Rodák",
            "Tosin Adarabioyo",
            "Shane Duffy",
            "Harry Wilson",
            "Tom Cairney",
            "Nathaniel Chalobah",
            "Dan James",
            "Luke Harris",
            "Carlos Vinícius"
        ],
        "team1_stat": {
            "possession_%": "62.5",
            "shots_on_target": "2",
            "shots": "8",
            "touches": "792",
            "passes": "579",
            "tackels": "19",
            "clearances": "23",
            "corners": "4",
            "offsides": "1",
            "yellow_cards": "0",
            "foul_conceded": "8"
        },
        "team2_name": "Southampton",
        "team2_startings": [
            "Gavin Bazunu",
            "Lyanco",
            "Mohammed Salisu",
            "Armel Bella-Kotchap",
            "Kyle Walker-Peters",
            "Ainsley Maitland-Niles",
            "James Ward-Prowse",
            "Mohamed Elyounoussi",
            "Joe Aribo",
            "Che Adams",
            "Samuel Edozie"
        ],
        "team2_subs": [
            "Willy Caballero",
            "Duje Caleta-Car",
            "Romain Perraud",
            "Stuart Armstrong",
            "Ibrahima Diallo",
            "Roméo Lavia",
            "Ryan Finnigan",
            "Adam Armstrong",
            "Sékou Mara"
        ],
        "team2_stat": {
            "possession_%": "37.5",
            "shots_on_target": "3",
            "shots": "9",
            "touches": "548",
            "passes": "342",
            "tackels": "21",
            "clearances": "16",
            "corners": "4",
            "offsides": "0",
            "yellow_cards": "1",
            "foul_conceded": "13"
        }
    },
    "14": {
        "event": [
            "Full-time Match ends, Manchester City 1, Everton 1.",
            "Second Half ends, Manchester City 1, Everton 1.",
            "Attempt missed. Rodri (Manchester City) header from very close range misses to the left. Assisted by Riyad Mahrez with a cross following a corner.",
            "Corner,  Manchester City. Conceded by James Tarkowski.",
            "Phil Foden (Manchester City) wins a free kick on the left wing.",
            "Foul by Vitaliy Mykolenko (Everton).",
            "Corner,  Manchester City. Conceded by Séamus Coleman.",
            "Yellow Card! Neal Maupay (Everton) is shown the yellow card for a bad foul.",
            "Foul by Neal Maupay (Everton).",
            "Nathan Aké (Manchester City) wins a free kick in the defensive half.",
            "Foul by John Stones (Manchester City).",
            "Neal Maupay (Everton) wins a free kick on the left wing.",
            "Attempt missed. Rodri (Manchester City) right footed shot from outside the box misses to the left. Assisted by Kevin De Bruyne.",
            "Attempt blocked. Ilkay Gündogan (Manchester City) right footed shot from outside the box is blocked. Assisted by Rodri.",
            "Attempt missed. Phil Foden (Manchester City) header from the centre of the box misses to the right. Assisted by Riyad Mahrez with a cross.",
            "Corner,  Manchester City. Conceded by Alex Iwobi.",
            "Attempt saved. Kevin De Bruyne (Manchester City) right footed shot from the right side of the box is saved in the bottom left corner. Assisted by Riyad Mahrez.",
            "Delay over. They are ready to continue.",
            "Substitution Substitution, Everton. Abdoulaye Doucouré replaces Ben Godfrey because of an injury.",
            "Delay in match  because of an injury Ben Godfrey (Everton).",
            "Neal Maupay (Everton) wins a free kick in the defensive half.",
            "Foul by Manuel Akanji (Manchester City).",
            "Foul by Ben Godfrey (Everton).",
            "Nathan Aké (Manchester City) wins a free kick in the defensive half.",
            "Substitution Substitution, Manchester City. Julián Álvarez replaces Bernardo Silva.",
            "Substitution Substitution, Manchester City. Phil Foden replaces Jack Grealish.",
            "Substitution Substitution, Manchester City. Ilkay Gündogan replaces Rico Lewis.",
            "Foul by Amadou Onana (Everton).",
            "Jack Grealish (Manchester City) wins a free kick in the defensive half.",
            "Offside, Manchester City. Rodri tries a through ball, but Bernardo Silva is caught offside.",
            "Attempt blocked. Rodri (Manchester City) right footed shot from the right side of the six yard box is blocked. Assisted by Bernardo Silva.",
            "Attempt saved. Riyad Mahrez (Manchester City) left footed shot from the centre of the box is saved in the bottom right corner. Assisted by Rodri.",
            "Attempt blocked. Kevin De Bruyne (Manchester City) left footed shot from the centre of the box is blocked. Assisted by Rodri.",
            "Attempt missed. Kevin De Bruyne (Manchester City) right footed shot from outside the box is close, but misses to the right. Assisted by Riyad Mahrez.",
            "Delay over. They are ready to continue.",
            "Delay in match  because of an injury James Tarkowski (Everton).",
            "Erling Haaland (Manchester City) wins a free kick in the defensive half.",
            "Foul by James Tarkowski (Everton).",
            "Foul by Jack Grealish (Manchester City).",
            "Demarai Gray (Everton) wins a free kick in the defensive half.",
            "Jack Grealish (Manchester City) wins a free kick in the defensive half.",
            "Foul by Séamus Coleman (Everton).",
            "Substitution Substitution, Everton. Tom Davies replaces Idrissa Gueye.",
            "Delay over. They are ready to continue.",
            "Delay in match  because of an injury Amadou Onana (Everton).",
            "Attempt blocked. Jack Grealish (Manchester City) right footed shot from the centre of the box is blocked. Assisted by Rodri.",
            "Attempt blocked. Jack Grealish (Manchester City) right footed shot from the left side of the box is blocked. Assisted by Kevin De Bruyne.",
            "Offside, Manchester City. Kevin De Bruyne tries a through ball, but Riyad Mahrez is caught offside.",
            "Foul by Alex Iwobi (Everton).",
            "Nathan Aké (Manchester City) wins a free kick in the attacking half.",
            "Substitution Substitution, Everton. Séamus Coleman replaces Nathan Patterson.",
            "Substitution Substitution, Everton. Neal Maupay replaces Dominic Calvert-Lewin.",
            "Corner,  Everton. Conceded by Bernardo Silva.",
            "Attempt blocked. Amadou Onana (Everton) right footed shot from outside the box is blocked. Assisted by Idrissa Gueye.",
            "Goal! Goal!  Manchester City 1, Everton 1. Demarai Gray (Everton) right footed shot from the left side of the box to the top right corner. Assisted by Idrissa Gueye   following a fast break.",
            "Yellow Card! Amadou Onana (Everton) is shown the yellow card for a bad foul.",
            "Foul by Amadou Onana (Everton).",
            "Rodri (Manchester City) wins a free kick in the attacking half.",
            "Rodri (Manchester City) wins a free kick in the defensive half.",
            "Foul by Dominic Calvert-Lewin (Everton).",
            "Foul by Jack Grealish (Manchester City).",
            "Nathan Patterson (Everton) wins a free kick in the defensive half.",
            "Delay over. They are ready to continue.",
            "Delay in match  because of an injury Alex Iwobi (Everton).",
            "Delay in match  because of an injury Jack Grealish (Manchester City).",
            "Foul by Manuel Akanji (Manchester City).",
            "Dominic Calvert-Lewin (Everton) wins a free kick in the defensive half.",
            "Delay over. They are ready to continue.",
            "Delay in match   (Manchester City).",
            "Corner,  Manchester City. Conceded by Nathan Patterson.",
            "Kick Off! Second Half begins Manchester City 1, Everton 0.",
            "Half-time First Half ends, Manchester City 1, Everton 0.",
            "Yellow Card! James Tarkowski (Everton) is shown the yellow card.",
            "Yellow Card! Erling Haaland (Manchester City) is shown the yellow card for a bad foul.",
            "Foul by Erling Haaland (Manchester City).",
            "Vitaliy Mykolenko (Everton) wins a free kick in the defensive half.",
            "John Stones (Manchester City) hits the right post with a header from the centre of the box. Assisted by Kevin De Bruyne with a cross following a set piece situation.",
            "Foul by Ben Godfrey (Everton).",
            "Erling Haaland (Manchester City) wins a free kick on the right wing.",
            "Corner,  Manchester City. Conceded by Nathan Patterson.",
            "Vitaliy Mykolenko (Everton) wins a free kick in the defensive half.",
            "Foul by Riyad Mahrez (Manchester City).",
            "Foul by Dominic Calvert-Lewin (Everton).",
            "Manuel Akanji (Manchester City) wins a free kick in the defensive half.",
            "Foul by Nathan Aké (Manchester City).",
            "Dominic Calvert-Lewin (Everton) wins a free kick in the defensive half.",
            "Yellow Card! Nathan Patterson (Everton) is shown the yellow card.",
            "Jack Grealish (Manchester City) wins a free kick on the left wing.",
            "Foul by Nathan Patterson (Everton).",
            "Yellow Card! Kevin De Bruyne (Manchester City) is shown the yellow card for a bad foul.",
            "Amadou Onana (Everton) wins a free kick on the right wing.",
            "Foul by Kevin De Bruyne (Manchester City).",
            "Nathan Patterson (Everton) wins a free kick in the defensive half.",
            "Foul by Erling Haaland (Manchester City).",
            "Attempt blocked. Riyad Mahrez (Manchester City) left footed shot from outside the box is blocked. Assisted by Kevin De Bruyne with a cross.",
            "Corner,  Manchester City. Conceded by James Tarkowski.",
            "Corner,  Manchester City. Conceded by Vitaliy Mykolenko.",
            "Attempt blocked. Kevin De Bruyne (Manchester City) right footed shot from outside the box is blocked. Assisted by Nathan Aké.",
            "Goal! Goal!  Manchester City 1, Everton 0. Erling Haaland (Manchester City) right footed shot from the centre of the box to the centre of the goal. Assisted by Riyad Mahrez.",
            "Delay over. They are ready to continue.",
            "Delay in match  because of an injury John Stones (Manchester City).",
            "Foul by Nathan Patterson (Everton).",
            "Jack Grealish (Manchester City) wins a free kick on the left wing.",
            "Offside, Everton. Ben Godfrey tries a through ball, but Dominic Calvert-Lewin is caught offside.",
            "Yellow Card! Bernardo Silva (Manchester City) is shown the yellow card.",
            "Bernardo Silva (Manchester City) has gone down, but the referee deems it simulation.",
            "Offside, Manchester City. Nathan Aké tries a through ball, but Bernardo Silva is caught offside.",
            "Attempt missed. Erling Haaland (Manchester City) left footed shot from a difficult angle on the left is close, but misses to the left. Assisted by Kevin De Bruyne with a through ball.",
            "Rico Lewis (Manchester City) wins a free kick in the attacking half.",
            "Foul by Demarai Gray (Everton).",
            "Offside, Everton. Conor Coady tries a through ball, but Dominic Calvert-Lewin is caught offside.",
            "Ben Godfrey (Everton) wins a free kick on the right wing.",
            "Foul by Erling Haaland (Manchester City).",
            "Amadou Onana (Everton) wins a free kick in the defensive half.",
            "Foul by Rodri (Manchester City).",
            "Delay over. They are ready to continue.",
            "Delay in match  because of an injury Erling Haaland (Manchester City).",
            "Kick Off! First Half begins.",
            "Lineups are announced and players are warming up."
        ],
        "matchweek": "Matchweek 18",
        "team1_name": "Manchester City",
        "team1_startings": [
            "Ederson",
            "John Stones",
            "Nathan Aké",
            "Manuel Akanji",
            "Rico Lewis",
            "Rodri",
            "Kevin De Bruyne",
            "Bernardo Silva",
            "Erling Haaland",
            "Jack Grealish",
            "Riyad Mahrez"
        ],
        "team1_subs": [
            "Stefan Ortega",
            "Kyle Walker",
            "João Cancelo",
            "Kalvin Phillips",
            "Ilkay Gündogan",
            "Sergio Gómez",
            "Phil Foden",
            "Cole Palmer",
            "Julián Álvarez"
        ],
        "team1_stat": {
            "possession_%": "73.7",
            "shots_on_target": "3",
            "shots": "16",
            "touches": "825",
            "passes": "662",
            "tackels": "13",
            "clearances": "7",
            "corners": "7",
            "offsides": "3",
            "yellow_cards": "3",
            "foul_conceded": "13"
        },
        "team2_name": "Everton",
        "team2_startings": [
            "Jordan Pickford",
            "James Tarkowski",
            "Nathan Patterson",
            "Vitaliy Mykolenko",
            "Ben Godfrey",
            "Conor Coady",
            "Amadou Onana",
            "Alex Iwobi",
            "Idrissa Gueye",
            "Dominic Calvert-Lewin",
            "Demarai Gray"
        ],
        "team2_subs": [
            "Asmir Begovic",
            "Mason Holgate",
            "Séamus Coleman",
            "Rúben Vinagre",
            "Abdoulaye Doucouré",
            "Tom Davies",
            "Isaac Price",
            "Dwight McNeil",
            "Neal Maupay"
        ],
        "team2_stat": {
            "possession_%": "26.3",
            "shots_on_target": "1",
            "shots": "2",
            "touches": "405",
            "passes": "238",
            "tackels": "13",
            "clearances": "35",
            "corners": "1",
            "offsides": "2",
            "yellow_cards": "4",
            "foul_conceded": "14"
        }
    },
    "15": {
        "event": [
            "Full-time Match ends, Newcastle United 0, Leeds United 0.",
            "Second Half ends, Newcastle United 0, Leeds United 0.",
            "Foul by Mateusz Klich (Leeds United).",
            "Kieran Trippier (Newcastle United) wins a free kick in the defensive half.",
            "Hand ball by Sean Longstaff (Newcastle United).",
            "Yellow Card! Bruno Guimarães (Newcastle United) is shown the yellow card.",
            "Yellow Card! Illan Meslier (Leeds United) is shown the yellow card.",
            "Yellow Card! Callum Wilson (Newcastle United) is shown the yellow card.",
            "Hand ball by Sean Longstaff (Newcastle United).",
            "Callum Wilson (Newcastle United) wins a free kick on the left wing.",
            "Foul by Robin Koch (Leeds United).",
            "Attempt blocked. Joe Gelhardt (Leeds United) left footed shot from the right side of the box is blocked. Assisted by Brenden Aaronson.",
            "Brenden Aaronson (Leeds United) wins a free kick in the attacking half.",
            "Foul by Dan Burn (Newcastle United).",
            "Foul by Joelinton (Newcastle United).",
            "Tyler Adams (Leeds United) wins a free kick on the left wing.",
            "Substitution Substitution, Newcastle United. Jacob Murphy replaces Miguel Almirón.",
            "Attempt missed. Joelinton (Newcastle United) left footed shot from the centre of the box is too high. Assisted by Allan Saint-Maximin.",
            "Substitution Substitution, Leeds United. Joe Gelhardt replaces Rodrigo.",
            "Corner,  Newcastle United. Conceded by Marc Roca.",
            "Offside, Newcastle United. Bruno Guimarães tries a through ball, but Miguel Almirón is caught offside.",
            "Foul by Kieran Trippier (Newcastle United).",
            "Crysencio Summerville (Leeds United) wins a free kick in the defensive half.",
            "Attempt missed. Joelinton (Newcastle United) header from the centre of the box misses to the right. Assisted by Kieran Trippier with a cross following a corner.",
            "Corner,  Newcastle United. Conceded by Pascal Struijk.",
            "Bruno Guimarães (Newcastle United) wins a free kick on the right wing.",
            "Foul by Mateusz Klich (Leeds United).",
            "Substitution Substitution, Leeds United. Rasmus Kristensen replaces Luke Ayling.",
            "Substitution Substitution, Leeds United. Crysencio Summerville replaces Wilfried Gnonto.",
            "Attempt missed. Sean Longstaff (Newcastle United) right footed shot from the right side of the box is too high. Assisted by Miguel Almirón.",
            "Yellow Card! Wilfried Gnonto (Leeds United) is shown the yellow card.",
            "Foul by Tyler Adams (Leeds United).",
            "Sean Longstaff (Newcastle United) wins a free kick on the right wing.",
            "Yellow Card! Marc Roca (Leeds United) is shown the yellow card for a bad foul.",
            "Foul by Marc Roca (Leeds United).",
            "Bruno Guimarães (Newcastle United) wins a free kick in the defensive half.",
            "Substitution Substitution, Newcastle United. Allan Saint-Maximin replaces Joe Willock.",
            "Substitution Substitution, Newcastle United. Callum Wilson replaces Chris Wood.",
            "Substitution Substitution, Leeds United. Mateusz Klich replaces Jack Harrison.",
            "Attempt missed. Sean Longstaff (Newcastle United) left footed shot from the centre of the box is high and wide to the left. Assisted by Joelinton.",
            "Corner,  Newcastle United. Conceded by Illan Meslier.",
            "Attempt saved. Fabian Schär (Newcastle United) header from the centre of the box is saved in the bottom left corner. Assisted by Kieran Trippier with a cross.",
            "Corner,  Newcastle United. Conceded by Liam Cooper.",
            "Yellow Card! Pascal Struijk (Leeds United) is shown the yellow card for a bad foul.",
            "Miguel Almirón (Newcastle United) wins a free kick on the right wing.",
            "Foul by Pascal Struijk (Leeds United).",
            "Bruno Guimarães (Newcastle United) wins a free kick on the left wing.",
            "Foul by Jack Harrison (Leeds United).",
            "Corner,  Newcastle United. Conceded by Robin Koch.",
            "Attempt saved. Rodrigo (Leeds United) left footed shot from the right side of the box is saved in the top left corner. Assisted by Jack Harrison.",
            "Foul by Wilfried Gnonto (Leeds United).",
            "Fabian Schär (Newcastle United) wins a free kick in the defensive half.",
            "Bruno Guimarães (Newcastle United) wins a free kick on the right wing.",
            "Foul by Jack Harrison (Leeds United).",
            "Attempt saved. Chris Wood (Newcastle United) right footed shot from the centre of the box is saved in the bottom left corner. Assisted by Dan Burn with a headed pass.",
            "Foul by Tyler Adams (Leeds United).",
            "Sean Longstaff (Newcastle United) wins a free kick on the right wing.",
            "Offside, Newcastle United. Bruno Guimarães tries a through ball, but Chris Wood is caught offside.",
            "Marc Roca (Leeds United) wins a free kick on the right wing.",
            "Foul by Joe Willock (Newcastle United).",
            "Attempt missed. Fabian Schär (Newcastle United) right footed shot from the left side of the box is high and wide to the right following a set piece situation.",
            "Foul by Pascal Struijk (Leeds United).",
            "Miguel Almirón (Newcastle United) wins a free kick on the right wing.",
            "Substitution Substitution, Leeds United. Marc Roca replaces Adam Forshaw.",
            "Kick Off! Second Half begins Newcastle United 0, Leeds United 0.",
            "Half-time First Half ends, Newcastle United 0, Leeds United 0.",
            "Attempt blocked. Kieran Trippier (Newcastle United) right footed shot from outside the box is blocked.",
            "Yellow Card! Luke Ayling (Leeds United) is shown the yellow card for a bad foul.",
            "Joe Willock (Newcastle United) wins a free kick in the attacking half.",
            "Foul by Luke Ayling (Leeds United).",
            "Offside, Newcastle United. Fabian Schär tries a through ball, but Chris Wood is caught offside.",
            "Yellow Card! Kieran Trippier (Newcastle United) is shown the yellow card for a bad foul.",
            "Foul by Kieran Trippier (Newcastle United).",
            "Wilfried Gnonto (Leeds United) wins a free kick on the left wing.",
            "Corner,  Leeds United. Conceded by Sven Botman.",
            "Attempt blocked. Rodrigo (Leeds United) left footed shot from the left side of the box is blocked. Assisted by Wilfried Gnonto.",
            "Attempt blocked. Joelinton (Newcastle United) right footed shot from outside the box is blocked.",
            "Corner,  Newcastle United. Conceded by Liam Cooper.",
            "Attempt missed. Jack Harrison (Leeds United) left footed shot from the left side of the box is close, but misses to the left. Assisted by Tyler Adams.",
            "Attempt saved. Joe Willock (Newcastle United) right footed shot from outside the box is saved in the bottom right corner. Assisted by Kieran Trippier.",
            "Corner,  Newcastle United. Conceded by Pascal Struijk.",
            "Miguel Almirón (Newcastle United) wins a free kick in the defensive half.",
            "Foul by Jack Harrison (Leeds United).",
            "Foul by Sean Longstaff (Newcastle United).",
            "Adam Forshaw (Leeds United) wins a free kick on the left wing.",
            "Attempt saved. Sven Botman (Newcastle United) left footed shot from the centre of the box is saved in the bottom left corner. Assisted by Kieran Trippier with a cross.",
            "Foul by Robin Koch (Leeds United).",
            "Joelinton (Newcastle United) wins a free kick in the attacking half.",
            "Attempt missed. Miguel Almirón (Newcastle United) left footed shot from outside the box misses to the left following a corner.",
            "Attempt missed. Dan Burn (Newcastle United) right footed shot from very close range misses to the left. Assisted by Joelinton with a headed pass following a corner.",
            "Corner,  Newcastle United. Conceded by Adam Forshaw.",
            "Foul by Kieran Trippier (Newcastle United).",
            "Jack Harrison (Leeds United) wins a free kick in the defensive half.",
            "Attempt blocked. Brenden Aaronson (Leeds United) right footed shot from the centre of the box is blocked. Assisted by Tyler Adams.",
            "Attempt missed. Fabian Schär (Newcastle United) header from the centre of the box is close, but misses to the left. Assisted by Kieran Trippier with a cross following a corner.",
            "Corner,  Newcastle United. Conceded by Pascal Struijk.",
            "Foul by Wilfried Gnonto (Leeds United).",
            "Sean Longstaff (Newcastle United) wins a free kick on the right wing.",
            "Luke Ayling (Leeds United) wins a free kick in the defensive half.",
            "Foul by Joelinton (Newcastle United).",
            "Foul by Wilfried Gnonto (Leeds United).",
            "Sean Longstaff (Newcastle United) wins a free kick in the defensive half.",
            "Foul by Jack Harrison (Leeds United).",
            "Bruno Guimarães (Newcastle United) wins a free kick in the defensive half.",
            "Foul by Kieran Trippier (Newcastle United).",
            "Wilfried Gnonto (Leeds United) wins a free kick in the defensive half.",
            "Attempt missed. Rodrigo (Leeds United) header from the centre of the box misses to the left. Assisted by Jack Harrison with a cross following a corner.",
            "Corner,  Leeds United. Conceded by Sean Longstaff.",
            "Attempt blocked. Wilfried Gnonto (Leeds United) right footed shot from outside the box is blocked.",
            "Adam Forshaw (Leeds United) wins a free kick on the right wing.",
            "Foul by Joe Willock (Newcastle United).",
            "Attempt saved. Joelinton (Newcastle United) right footed shot from the left side of the box is saved in the centre of the goal. Assisted by Chris Wood.",
            "Foul by Joelinton (Newcastle United).",
            "Luke Ayling (Leeds United) wins a free kick in the defensive half.",
            "Foul by Wilfried Gnonto (Leeds United).",
            "Miguel Almirón (Newcastle United) wins a free kick in the defensive half.",
            "Attempt missed. Chris Wood (Newcastle United) right footed shot from a difficult angle on the right misses to the right. Assisted by Kieran Trippier with a through ball.",
            "Chris Wood (Newcastle United) wins a free kick in the defensive half.",
            "Foul by Pascal Struijk (Leeds United).",
            "Corner,  Leeds United. Conceded by Sven Botman.",
            "Attempt missed. Wilfried Gnonto (Leeds United) right footed shot from outside the box is high and wide to the left. Assisted by Adam Forshaw.",
            "Kick Off! First Half begins.",
            "Lineups are announced and players are warming up."
        ],
        "matchweek": "Matchweek 18",
        "team1_name": "Newcastle United",
        "team1_startings": [
            "Nick Pope",
            "Kieran Trippier",
            "Sven Botman",
            "Fabian Schär",
            "Dan Burn",
            "Joe Willock",
            "Sean Longstaff",
            "Bruno Guimarães",
            "Joelinton",
            "Chris Wood",
            "Miguel Almirón"
        ],
        "team1_subs": [
            "Karl Darlow",
            "Jamaal Lascelles",
            "Jamal Lewis",
            "Javier Manquillo",
            "Matt Ritchie",
            "Jacob Murphy",
            "Elliot Anderson",
            "Callum Wilson",
            "Allan Saint-Maximin"
        ],
        "team1_stat": {
            "possession_%": "59",
            "shots_on_target": "5",
            "shots": "16",
            "touches": "640",
            "passes": "419",
            "tackels": "16",
            "clearances": "11",
            "corners": "9",
            "offsides": "3",
            "yellow_cards": "3",
            "foul_conceded": "13"
        },
        "team2_name": "Leeds United",
        "team2_startings": [
            "Illan Meslier",
            "Luke Ayling",
            "Robin Koch",
            "Liam Cooper",
            "Pascal Struijk",
            "Adam Forshaw",
            "Brenden Aaronson",
            "Jack Harrison",
            "Tyler Adams",
            "Wilfried Gnonto",
            "Rodrigo"
        ],
        "team2_subs": [
            "Joel Robles",
            "Junior Firpo",
            "Diego Llorente",
            "Rasmus Kristensen",
            "Marc Roca",
            "Crysencio Summerville",
            "Mateusz Klich",
            "Joe Gelhardt",
            "Sam Greenwood"
        ],
        "team2_stat": {
            "possession_%": "41",
            "shots_on_target": "1",
            "shots": "8",
            "touches": "499",
            "passes": "297",
            "tackels": "32",
            "clearances": "23",
            "corners": "3",
            "offsides": "0",
            "yellow_cards": "5",
            "foul_conceded": "19"
        }
    }
}